[{"reviewerID": "A1UKA7HUAQAMY", "asin": "B00BH9GNYU", "reviewerName": "Alison Hudson \"Ariamythe\"", "helpful": [0, 0], "unixReviewTime": 1403136000, "reviewText": "As a whteboard, I have no issues with this product. It's a nice whiteboard, It went over my desk and it's a good size for jotting things down when I need to. The magnetic quality is also great for hanging documents,I was not fond of the marker that came with this. It seemed to be weak. I bought better, bolder markers for writing with, then just got a strip of magnet tape to use to make them hang like the one that came with it.", "overall": 4.0, "reviewTime": "06 19, 2014", "summary": "Great Board, Mediocre Marker"}
,
{"reviewerID": "A2VDZ27CMLJVVH", "asin": "B00BH9GNYU", "reviewerName": "Amber FLYNN", "helpful": [1, 2], "unixReviewTime": 1401062400, "reviewText": "1) Quality!  Quality!  Quality!  Finally..... I hate those boards that you try to completely erase only to have to put a ton of elbow grease into it with no effect! I purposely left a lot of ink on the board and after two weeks I could erase the words completely.  Cheaper boards don't erase completely.  This is quality.2) Magnetic!!!  It comes with two magnets, which is awesome!  Dual purpose board.3) Affordable.  Its $10!4) Includes the Hardware to Hang.  You will need to drill holes in the wall, and insert wall anchors.  Then slide the board down onto the brackets.  Instructions are included.  I decided NOT to hang my board.  Its small enough to move around my office floor.  No need to hang for me.5) Comes with a ONE Dry Erase Marker that is magnetic.", "overall": 5.0, "reviewTime": "05 26, 2014", "summary": "Quality, Affordable, Magnetic.  with Hardware to Hang. Finally a Dry Erase Board with All I NEED."}
,
{"reviewerID": "A2NCWLAWOVCKF7", "asin": "B00BH9GNYU", "reviewerName": "Amy in Ohio", "helpful": [0, 0], "unixReviewTime": 1399939200, "reviewText": "What is there to say about a dry-erase board?  It functions exactly as it should-- the marker is smooth and easy to see, it erases cleanly, and the magnets are a nice bonus.  I can clip a coupon or a school permission slip right there next to the relevant note on the board. The frame is substantial enough that it makes it look like a quality piece, rather than just an inexpensive white board.Disclosure:  I was given this product for free in return for posting my honest review online via the Amazon Vine program.  I always post my honest opinion regardless of the source of the product.", "overall": 4.0, "reviewTime": "05 13, 2014", "summary": "does what it should"}
,
{"reviewerID": "A2AYYKD4OODSLY", "asin": "B00BH9GNYU", "reviewerName": "April E. \"just a mom\"", "helpful": [0, 0], "unixReviewTime": 1400544000, "reviewText": "I was planning to use this for tracking the kids chores, but that turned out to be an unpopular idea.  Go figure. Instead, I hung it in my daughter's room. She uses it to write reminders to herself, and can use the magnets to hold photos up there, as well. Sometimes her brothers leave notes, asking her if she wants to do something with them. I'm glad I let it be her memo/message center instead of my chore chart.It hangs easily, and is light-weight. I thought the magnets would be too weak to hold much, but I was wrong. They are stronger and more effective than they seem. Overall, it is nice for home use. It might not last long in a professional setting with heavy use, but it should hold up well for our purposes.", "overall": 4.0, "reviewTime": "05 20, 2014", "summary": "nice for an office, chore chart, or kids bedroom"}
,
{"reviewerID": "AQB4DH57MSZSC", "asin": "B00BH9GNYU", "reviewerName": "A Regular Joe", "helpful": [0, 0], "unixReviewTime": 1402444800, "reviewText": "Works as advertised - solid construction and well built. Erases with no residue left over, just make sure you remove the glue from the magnets. The board is not loose in the frame as so many of these less expensive white boards are.", "overall": 5.0, "reviewTime": "06 11, 2014", "summary": "Wipes clean, works great"}
,
{"reviewerID": "A2TDWDE3ZSSCA1", "asin": "B00BH9GNYU", "reviewerName": "Arwen \"AKA Arwen\"", "helpful": [0, 0], "unixReviewTime": 1400630400, "reviewText": "I like this dry-erase board. It does the job. There is ample amount of space for lists and reminders. The marker that comes with it is...inadequate. It doesn't last. The magnet that holds it is &#34;not so much&#34; if you know what I mean.I don't like that you can't choose what color the frame is even if you buy it.But all in all, this board does provide the space you need to write the things you do. Just don't put a lot of faith in the magnets provided!", "overall": 4.0, "reviewTime": "05 21, 2014", "summary": "Useful"}
,
{"reviewerID": "A3EXW4HNYX7HF5", "asin": "B00BH9GNYU", "reviewerName": "Atomic Tofu \"Code of Bushido\"", "helpful": [0, 0], "unixReviewTime": 1401494400, "reviewText": "My first dry-erase board for home use so I don't have much experience in this arena but from what I can tell, it's a good value for the purchase.  Price to what you get seems very reasonable. And the size is quite adequate as well.  So far everything seems to perform as it should in regards to writing and wiping off.  1 star deducted due to the RANDOM nature of wood or black frame choice.  Otherwise would have been 5 stars.", "overall": 4.0, "reviewTime": "05 31, 2014", "summary": "Works well for us"}
,
{"reviewerID": "AH1KJ45IQTM4T", "asin": "B00BH9GNYU", "reviewerName": "Benjamin", "helpful": [0, 0], "unixReviewTime": 1400112000, "reviewText": "Highly recommended white board that you can write and write and write and erase and erase and erase, and it comes handy for daily announcements, for short messages, etc. It is medium size, just 17 x 23, but it serves its purpose. Highly recommended. Thanks.", "overall": 5.0, "reviewTime": "05 15, 2014", "summary": "Excellent!"}
,
{"reviewerID": "A3I9XZGYARBLS4", "asin": "B00BH9GNYU", "reviewerName": "B L \"And that's that.\"", "helpful": [0, 0], "unixReviewTime": 1401840000, "reviewText": "Really good quality and cleans up nice. I put it up in my office to keep tabs on what task are needed to be done. Its really nice that the pen is magnetic so your never hunting it down. It also comes with 2 magnets so you can notes up as well.", "overall": 5.0, "reviewTime": "06 4, 2014", "summary": "Really nice"}
,
{"reviewerID": "A27QXQQOLAMRRR", "asin": "B00BH9GNYU", "reviewerName": "Bone \"JLLaser-net\"", "helpful": [0, 0], "unixReviewTime": 1403049600, "reviewText": "This is a pretty good board and it looks great but the problem I have is that the boarders on it are pretty thick. I have another one that's the same total size but the boarders are much smaller so the writing surface is a good bit more. Easily there the boarders could be cut back 1 inch all around if not 1.5 inch. You don't need that large of a boarder.The one thing that I really did like about this one is that it came with some nice metal hardware for wall mounting. wide metal &#34;hooks&#34; that will slide in behind the edge of the board to hang on the wall but allow you to easily take it off the wall when needed. I have a number of white boards all over the house to put reminders on and also to work out all the crazy formulas that I deal with on a regular basis. This one went in my main hallway as the boarder is nice. I keep my reminders there for when I come and go from the house.It is a magnetic surface as well so you can use the magnets to hold paper notes in place.For markers I have switched to only using Quartet Enduraglide markers, they last a lot longer and the tips don't dry out while you are thinking about something to write down. Working on calculus, physics, or whatever it is that I'm using to solve various issues that I'm working on I tend to have to stop and think a lot and normal markers dry out far too quick. The enduraglides just last so much longer and they are pretty much the same price....This board seems to be of good quality though and doesn't seem to be holding up to the abuse I have given it. I just would like thinner boarders to increase the writing area more like the other boards that I have.", "overall": 4.0, "reviewTime": "06 18, 2014", "summary": "Looks great but boarder is thick and reduces writing surface."}
,
{"reviewerID": "A3EK2KTYHJCPB9", "asin": "B00BH9GNYU", "reviewerName": "Brian R.", "helpful": [0, 0], "unixReviewTime": 1401062400, "reviewText": "The board erases cleanly, thought, which is always a benefit, and really is one of the most important aspects.  I'd definitely suggest some better pens and a real eraser.The frame is a bit cheap looking (we got the wood one), as it's basically a wood decal wrapped around some sort of cheap wood or something.  It's a nice touch that the wood frame is beveled on the whiteboard side, making it easier to write and clean close to the edges.  The magnets stick well enough and the board isn't industrial strength, but it's not flimsy, either.  The back of the board is backed with cardboard to help fill the gap behind the board to the edge of the frame.The magnets were shipped with double-sided tape on the magnets to ensure they adhere to the board, and it was really hard to get the tape all the way off.  Wall hangers are included, but not pre-installed.", "overall": 5.0, "reviewTime": "05 26, 2014", "summary": "Excellent whiteboard"}
,
{"reviewerID": "AVH4LC6EDRVWG", "asin": "B00BH9GNYU", "reviewerName": "Catherine Todd \"interested in all\"", "helpful": [0, 0], "unixReviewTime": 1400716800, "reviewText": "I like the fact that we can use dry-erase markers and magnets to hold anything needed for our daily notes. Easy to mount to the wall, with hardware included. Does just what it is supposed to do, and our employees have come to rely on it daily. So much easier than finding scotch-taped notes everywhere, or falling to the floor! Mixing the dry-erase and the magnetic surface is an ingenious idea! And the wood frame is a nice touch. You could even make a nice photo-montage board with it if you like.", "overall": 4.0, "reviewTime": "05 22, 2014", "summary": "Works for our organic vegetable business"}
,
{"reviewerID": "A7EU2BWLLCJY2", "asin": "B00BH9GNYU", "reviewerName": "Claire Jordan \"Filmmaker - &#34;The Baroness ...", "helpful": [0, 0], "unixReviewTime": 1399939200, "reviewText": "I love dry erase boards!  I have one wall in my office that is just one big white board but that's where I map out strategies for projects.  I needed something smaller and separate for making lists and this board is perfect for that.  It has a nice frame around it so it looks good wherever you put it and it has two round, acrylic magnets for attaching notes.  It even comes with a pen (but buy more, this one is small and will run out quickly if you use it much.)  It's a good size for most normal white board uses and looks nice enough to hang anywhere from an office to a kitchen to a kid's room.  It has a good writing surface and wipes off nicely.  It's a really nice dry erase board.", "overall": 5.0, "reviewTime": "05 13, 2014", "summary": "Great little dry erase board!"}
,
{"reviewerID": "A3DOPYDOS49I3T", "asin": "B00BH9GNYU", "reviewerName": "Confucious", "helpful": [0, 0], "unixReviewTime": 1403049600, "reviewText": "This a great board for the price. Was thinking of making my own using a sheet from the home depot. This one already comes framed, with hardware, 2 magnets and a marker with eraser. The hardware is a plus and you can mount it somewhere permanently. The magnets are great to put some papers or notes on the white board. The marker works great and it is a fine tip. The eraser on the cap is great since you don't have to use your finger. Overall a great board and great size.", "overall": 5.0, "reviewTime": "06 18, 2014", "summary": "Great board..."}
,
{"reviewerID": "A3950CIY7HJZS8", "asin": "B00BH9GNYU", "reviewerName": "Corban Storm", "helpful": [0, 0], "unixReviewTime": 1404345600, "reviewText": "I was simply looking for a medium size dry erase board that was magnetic as well. Comes with a marker with a mini-eraser on the end (with a little magnet) and two small magnets. Looks attractive... the frame is not wood but sure looks like it.And really, for $10, you can by several of these things to put in targeted areas around the house or office. I am very pleased.", "overall": 5.0, "reviewTime": "07 3, 2014", "summary": "You can't do better for $10"}
,
{"reviewerID": "A31YSTICHFYN7O", "asin": "B00BH9GNYU", "reviewerName": "CPR \"xfilebuffyfan\"", "helpful": [0, 0], "unixReviewTime": 1400716800, "reviewText": "I got these to give to my girlfriend for teaching her classroom.  She often has to work with special activities for small groups - like testing & evaluation.  She can use this board to show children something she has written - like a letter or number.  But also, she can use the magnet to attach a copy of the worksheet on the side.  This way the children can look at her large writing and a paper sample of the form they have, both while she only has to hold the board with one hand.  This makes giving instructions in the small groups easier & allows her to use her free hand to write with the dry erase marker.  The simplicity of adding a magnet really makes a big different.  Before she would have to use the corner of the board or with double stick tape - both were not ideal & wasted time.  This works really well to speed things along.", "overall": 5.0, "reviewTime": "05 22, 2014", "summary": "Markers & Magnets - All on the Same Board"}
,
{"reviewerID": "AE12AEJFCOGGY", "asin": "B00BH9GNYU", "reviewerName": "David Montgomery \"Book Critic\"", "helpful": [0, 0], "unixReviewTime": 1403654400, "reviewText": "You don't expect much from a dry erase board. You want it to be sturdy enough so that it won't fall apart, you want it to be clear and easy to write on, and you want the markings to easily erase without leaving a mess behind. This board satisfies those criteria. I'd give it 5 stars, but the mounting hardware was inconvenient. Overall, though, a fine product.", "overall": 4.0, "reviewTime": "06 25, 2014", "summary": "Does the job!"}
,
{"reviewerID": "A2AZIQJGBLU7WN", "asin": "B00BH9GNYU", "reviewerName": "DJ Deathwish", "helpful": [0, 0], "unixReviewTime": 1399766400, "reviewText": "I was looking a larger board and this one is ideal. Very attractive, easy to hang and very sturdy, if you need a larger board, you can honestly do no wrong here.", "overall": 5.0, "reviewTime": "05 11, 2014", "summary": "17x24 Magnetic Dry Erase Board"}
,
{"reviewerID": "A3CJ7MHAS9IMAM", "asin": "B00BH9GNYU", "reviewerName": "Dom Miliano", "helpful": [0, 0], "unixReviewTime": 1401321600, "reviewText": "We have a lot of cars&#8230; Too many, some might say. However, to save money, I do most of the maintenance myself so having a simple way to keep track of each vehicle's status was needed. Normally, I write the services performed in a book that we keep in each glove compartment. Accurate, but requires that I go into each car to check on when the next oil change or other service is due. Since I don't drive all of the cars, having a quick visual method to check was needed. With this board, hung up in the garage, I have lines drawn between each car's service history and use different color pens to make quick work of keeping them separate (bought separately). It has helped and allows me to plan the purchase of filters, oil and other consumables. Nice...The board comes with magnets so I can attach scraps of paper from the boxes that have part numbers for oil or air filter to keep track of the proper part number for the next service.Overall, it works (for me) as I intended. Some thoughts - the garage s not heated so I think the pen(s) may freeze in the winter. I'll have to remember to keep them in the house.Recommended", "overall": 4.0, "reviewTime": "05 29, 2014", "summary": "An effective tool to help keep track of my car service schedule"}
,
{"reviewerID": "A7UPJYPAH73NC", "asin": "B00BH9GNYU", "reviewerName": "Douglas Figueredo", "helpful": [0, 0], "unixReviewTime": 1402272000, "reviewText": "Good value for what you get. One thing is that the frame is not a pure wood frame. I had wanted to paint it, but it is some sort of plastic veneer that I'd need to sand and then prime - which is not gonna happen. Otherwise, it's a fine erase board and comes with a marker and two magnets that work well for light notes. I think the price is right on this and that it is well constructed.", "overall": 5.0, "reviewTime": "06 9, 2014", "summary": "good value"}
,
{"reviewerID": "A5CDMTW6JKV5G", "asin": "B00BH9GNYU", "reviewerName": "Dr. Wilfredo M. Viray \"Wally\"", "helpful": [0, 0], "unixReviewTime": 1399593600, "reviewText": "There isn't much to say really.  It does what it is supposed to do.  We use it to write the things to do for the day.  It is easy to erase as well.", "overall": 5.0, "reviewTime": "05 9, 2014", "summary": "Very functional Dry-erase board"}
,
{"reviewerID": "A1G5B9VY2HWFUI", "asin": "B00BH9GNYU", "reviewerName": "dwb", "helpful": [0, 0], "unixReviewTime": 1404604800, "reviewText": "We bought this for my mom who lives in assisted living - we leave notes and reminders on it to make things easier for her to remember.  Perfect for our needs.", "overall": 5.0, "reviewTime": "07 6, 2014", "summary": "Nice product!"}
,
{"reviewerID": "A1KKE6VX8VPWZK", "asin": "B00BH9GNYU", "reviewerName": "Geekdomo \"GeekDomo\"", "helpful": [0, 0], "unixReviewTime": 1403136000, "reviewText": "This is a standard white board. Medium size. I put this in my daughter's room and she has been using it every day for over a month now. She likes to do art on it and also I put tasks on it for her to do. Its plenty big enough for her. Its not a massive board so check the size before ordering. As with all Quartet boards, clean with the right cleaner and it will last a long time.Overall very happy with it! Thanks for reading my review.", "overall": 5.0, "reviewTime": "06 19, 2014", "summary": "Very useful - easy to clean"}
,
{"reviewerID": "ALSAOZ1V546VT", "asin": "B00BH9GNYU", "reviewerName": "Getitright \"Stick to the facts reviews\"", "helpful": [0, 0], "unixReviewTime": 1401321600, "reviewText": "This whiteboard in very small, which makes it fit places where one normally wouldn't. We put it vertically next to our activities calendar and have found it to be very useful - especially since its so easy to wipe clean and start over!", "overall": 5.0, "reviewTime": "05 29, 2014", "summary": "Tiny whiteboard!"}
,
{"reviewerID": "A27HB4L3I1WJUR", "asin": "B00BH9GNYU", "reviewerName": "happy reader \"d/mil\"", "helpful": [0, 0], "unixReviewTime": 1399852800, "reviewText": "I have a smaller Dry-Erase Board  and it hangs by the door leaving my house.  This larger one is my list maker.  It hangs in my kitchen and I am learning to write on it immediately  the food or cleaning product I discover is about gone.  Now I check my erase board before leaving the house and...thankfully...my cupboard and cleaning supply shelf if in good shape.  I also write notes to myself..sometimes in very big letters to get my attention.  Then...when the event or the supply is complete....just a quick swipe across and that item is gone.PS.  The grandkids love to draw on it when they're visiting.", "overall": 5.0, "reviewTime": "05 12, 2014", "summary": "Great  list maker"}
,
{"reviewerID": "A3F43PAJZLOE3I", "asin": "B00BH9GNYU", "reviewerName": "ice grizzly \"Grrrrrr\"", "helpful": [0, 0], "unixReviewTime": 1401580800, "reviewText": "Great white board. Good for regular use and cleans off nicely without leaving marks. There are no bumps or cracks. I love the quality of the boards that come off nice and smooth without surface blemishes. Most of the cheap boards are already dinged or have bumps making it hard to draw pictures and may work well for writing.  Sturdy and super easy to clean .. what more to ask for. Great product.", "overall": 5.0, "reviewTime": "06 1, 2014", "summary": "Easy to clean and sturdy"}
,
{"reviewerID": "A38BE06WWL20AY", "asin": "B00BH9GNYU", "reviewerName": "James Mcritchie \"Publisher/Investor\"", "helpful": [0, 0], "unixReviewTime": 1402876800, "reviewText": "At less than $11 dollars, you can't beat the price. You can't specify finish but either would have worked for me. I got the &#34;wood&#34; finished plastic. The magnets provided are weak, the pen and eraser don't last long. I didn't use the hardware; just leaning it against the wall on a fairly obscure portion of our kitchen counter.We mostly use it as a message board. It works fine for that and we generally use Post-it notes, rather than the somewhat smelly earasable ink.  We also bought a &#34;magnetic poetry kit,&#34; so are having lots of fun showing off our cleaver word skills. Another creative outlet that can double as a way to check in on the family psychology.", "overall": 4.0, "reviewTime": "06 16, 2014", "summary": "Functional and Good Value"}
,
{"reviewerID": "A3VSO43VH3H0AT", "asin": "B00BH9GNYU", "reviewerName": "Jane E. Applebee", "helpful": [0, 0], "unixReviewTime": 1403136000, "reviewText": "This white board comes with 2 decorative magnets and a dry erase pen that has a magnet on one side of the cap and an eraser on the tip - very handy. The frame is a wood-like plastic affair that leaves me yearning for real wood, but you can't have everything and it is a reasonable product for the price. I have been using mine for over a month and there are no issues with residue or staining. Very good for the office, kind of big for me for at home, and the plastic wood issue, so I left mine at work. (If you don't necessarily need this larger size, please see Quartet Magnetic Dry-Erase  11 inch x 14 inch magnetic white board, I really prefer it for home and use it on the fridge, it looks nice and the chrome color frame is of better quality than the &#34;wood&#34;.)", "overall": 4.0, "reviewTime": "06 19, 2014", "summary": "Magnetic"}
,
{"reviewerID": "AO3FXH82HEPY3", "asin": "B00BH9GNYU", "reviewerName": "Jennifer AlLee", "helpful": [0, 0], "unixReviewTime": 1403136000, "reviewText": "I was looking for a place to put important family messages and information, and this board does a great job. I love that I not only can leave notes, but the magnets allow me to post papers that we want to refer to. The only problem I had with it is that the pen was totally dry when I received it, but I simply bought a new one.", "overall": 5.0, "reviewTime": "06 19, 2014", "summary": "Great board"}
,
{"reviewerID": "A3E9WG5BEAFF3T", "asin": "B00BH9GNYU", "reviewerName": "Jill Hart \"cwahmjill\"", "helpful": [0, 1], "unixReviewTime": 1398902400, "reviewText": "This Quartet Dry-Erase Board is a great! It's big and well made, easy to use by either hanging on the wall or using an easel. It's magnetic, so you can also use it to hang notes as well as write them.", "overall": 5.0, "reviewTime": "05 1, 2014", "summary": "Great Product"}
,
{"reviewerID": "A1SB9BNNGKNX2Z", "asin": "B00BH9GNYU", "reviewerName": "Jim", "helpful": [4, 4], "unixReviewTime": 1398729600, "reviewText": "The wood finish frame looks much nicer than I anticipated. It seems to consist of some kind of laminate over wood, a guess I base on what I can see where there's a small tear in the \"wood finish\" on the bottom of the frame of the board I received. It looks like it could be peeled off.The board itself seems like any other dry-erase board I've used (and is magnetized, like a smaller dry-erase board I have on my fridge). The included pen has a pretty narrow point and makes a line about the thickness of a standard size Sharpie, and the pen cap holds a fat dry-marker eraser and is magnetized on one end, to hold the pen to the board. Two plastic discs with magnets on the back are included, as is hardware for mounting the board to a wall.I mounted the board I received to a solid wood door, and used small screws that I had. The mounting instructions are for mounting the board to a wall, and for that you'll need a Philips head screwdriver and possibly a drill. The included hardware consists of two long screws and two anchors - the anchors will be necessary with some walls and not with others - and a pair of brackets that support the back of the frame. You'll also need a level or at least a tape measure so you can mount the hardware levelly and accurately. On my old postal scale the board weighs about 2 1/2 lbs.", "overall": 5.0, "reviewTime": "04 29, 2014", "summary": "Wood finish board is pretty nice looking"}
,
{"reviewerID": "AL9WKVMRI6GFB", "asin": "B00BH9GNYU", "reviewerName": "JMM", "helpful": [1, 1], "unixReviewTime": 1400025600, "reviewText": "This 23 x 17 dry-erase board is a decent product.  It works well enough to write down notes or a to-do list.  The main issue is that it can be difficult to completely remove the residue from what you have written (this gets worse the longer you leave something on the board without cleaning it).In terms of mounting the board - it can be mounted in the horizontal or vertical position.  The board is mounted with two screws (included) and it's a relatively easy job to get it up on the wall.Also included are two magnets as well as a cheap marker.  The magnets are a nice addition; they can hold an index card or a few pieces of paper, but unfortunately cannot handle much weight beyond that.  I'd also suggest investing in better markers as well as a sponge-sized heavy duty eraser.This isn't a bad option for a bedroom or a student's dorm - it looks nice and is a good size for a reasonable price.  But if you happen to be looking for something for professional/business use, I would suggest looking for a board of higher quality.", "overall": 3.0, "reviewTime": "05 14, 2014", "summary": "Quartet Dry Erase Board (23 x 17)"}
,
{"reviewerID": "AF3BYMPWKWO8F", "asin": "B00BH9GNYU", "reviewerName": "Joe MacBu", "helpful": [0, 0], "unixReviewTime": 1403136000, "reviewText": "As a whiteboard, this works well enough. The magnet isn't that strong, and the overall quality is not that great. The frame is warped in some areas. The eraser attached to the pen works, but it's really too small to be practical - I use a paper towel instead. The two attached magnets do work well though.", "overall": 3.0, "reviewTime": "06 19, 2014", "summary": "Good enough for a cheap price"}
,
{"reviewerID": "ABQWMANK4AR63", "asin": "B00BH9GNYU", "reviewerName": "John S. Dean \"John\"", "helpful": [1, 1], "unixReviewTime": 1399161600, "reviewText": "I had picked up a different similar sized whiteboard from the Vine program a couple months ago.  That one was not well made, poor construction, pretty flimsy frame that didn't even line up right, and had a dent.  It just felt and looked a bit cheap.This one is pretty much the complete opposite.  The frame is solid and joined well all around, no gaps, no misaligned pieces.  The other one, however, came with double sided sticky tape to mount it to the wall, and it held so securely that when I removed it to put this in its place, it peeled paint and a bit of the drywall surface from those four spots.  I wish this had come with a similar option, so I will have to pick some up from the local brick and mortar to mount it myself, as I prefer that to the drywall anchors and screws it comes with.I got the black, which I preferred, so that worked out well as we had no color choice.  The black frame looks very good around this, much more visually appealing than the poorly done white frame around the one this is replacing.It is a better surface than the other one I had as well.  My only complaint is the depth of the board in relation to the frame.  The frame is quite thick, so the board is recessed quite a bit from the front surface of the actual frame.  That makes it a bit more awkward doing things around the edge of this whiteboard.  From a use perspective, I would've preferred something with the whiteboard surface more flush with the frame.  However, that bulkier frame is part of what makes this one such a better build quality than the other one, so it's ultimately a wash.The magnets came with some horribly tacky glue holding them to the surface of the board, and that stuff was a real pain to get off of both the board and the magnet, but more so the board because of how that residue interferes with the marker.  And I&#34;m not a fan of things like &#34;goo gone&#34; since I've had that stuff ruin other items when I've tried to use it, most notably a nice speaker bar that I have hanging in my bedroom above my TV.  But eventually I was able to get this gunk off without damaging the surface of the board.  Annoying, but hardly a design flaw.It works well, writing and erasing.  The magnets stick to it alright, but I'll be purchasing some rare earth magnets to use on it instead such as the ones I have at home for the fridge, since they stick so much better than the weak magnets that these kinds of boards always seem to ship with.  A slight breeze from my office window is enough to send anything flying that these magnets were holding to the surface.All told, this one is my favorite smaller sized whiteboard I've had either at home or work.  It's well built and a good value for someone looking to purchase one in this size.", "overall": 4.0, "reviewTime": "05 4, 2014", "summary": "Much more sturdy than my other whiteboard was"}
,
{"reviewerID": "A3SLC8F6VIWXIR", "asin": "B00BH9GNYU", "reviewerName": "John T. Horner \"jthorner\"", "helpful": [0, 0], "unixReviewTime": 1402185600, "reviewText": "Honestly this product is nothing extraordinarly good or bad for it's type. Reasonably well made and does the job. There is no pen rail to hold your markers, which is an annoyance.", "overall": 4.0, "reviewTime": "06 8, 2014", "summary": "A decent midsized white board"}
,
{"reviewerID": "A2VW4FYZILSXF2", "asin": "B00BH9GNYU", "reviewerName": "Jojoleb \"jojoleb\"", "helpful": [0, 0], "unixReviewTime": 1402012800, "reviewText": "The Quartet Magnetic Dry-Erase board is a no-frills 17 x 23&#8221; board that sets up easily and does the job well.The board comes packaged with hardware to install it, two magnets, and a black marker.  If you are working on dry wall, you will need a drill, hammer, and Philips head screwdriver for the install.  (If you are installing it on a wooden surface, you will be able to get away with just a screw driver.)  Basically, you have to screw two brackets into the wall. The key thing is to make sure that they are level.  The board simply slips into the brackets and stays in place.  There are no lower brackets to stabilize it, but on a board this size, it seems like two do the trick pretty well.Once installed, the board functions perfectly well.  The black marker that is supplied works well and is easy to write with and erase with.  It is magnetized on one end, so it conventiently sticks to the board between uses. It has an eraser on one end which is good for small areas of erasure (less messy than using a finger), but once you fill up the board you will  have to use a cloth or buy a large dry-erase eraser in order to effectively erase large areas.  You will also need to clean the board, periodically, with a dry-erase cleaning solution (You can make your own by diluting 70% isopropyl [rubbing] alcohol 1:3 with water.  Some use straight alcohol, but I haven&#8217;t found this necessary.). The two magnets that come with the board are useful for hanging paper items, but probably not more than 1-2 sheets of paper thick.There is no bottom ledge or place to store extra markers or an eraser.  This makes sense, as this is a magnetized board and, I suppose, they expect you to buy magnetized supplies that stick to the board.  However, it would have been nice to include this, as most accessories available in offices are non-magnetized.This is a nice, basic dry erase board suitable for home or office use.  Recommended.", "overall": 4.0, "reviewTime": "06 6, 2014", "summary": "Simple, basic dry erase board, suitable for home or office use"}
,
{"reviewerID": "A1RR36YKJB917S", "asin": "B00BH9GNYU", "reviewerName": "J. Thompson \"Janet's Treasures, a little of e...", "helpful": [0, 0], "unixReviewTime": 1400112000, "reviewText": "Although it is a bit larger than the old one we replaced, it isn't too big. It is great as a family communication center. Plenty of room to write grocery lists, keep track of everyone's activities, etc. It also comes with 2 magnets so you can hang pictures, notes, etc.", "overall": 4.0, "reviewTime": "05 15, 2014", "summary": "A very handy dry erase board"}
,
{"reviewerID": "A2MCC0XFURU2K2", "asin": "B00BH9GNYU", "reviewerName": "Judah Levi", "helpful": [0, 0], "unixReviewTime": 1403136000, "reviewText": "This is a nicely sized dry-erase board which can be placed into any home or office.  Included are several different ways to attach the board for use.  The one I received had a black finish frame which was a good contrast to the white board.It is easy to clean and use.  For low-tech ideas or posting schedules, it is a great board!", "overall": 5.0, "reviewTime": "06 19, 2014", "summary": "Great Board!"}
,
{"reviewerID": "AQIJ3ZEEVCIKU", "asin": "B00BH9GNYU", "reviewerName": "Kaio", "helpful": [1, 1], "unixReviewTime": 1399248000, "reviewText": "The board itself seems good. The frame has a nice finish, is glossy and feels smooth. The hanging hardware is ok. It screws directly into the wall and then you just hang the board onto it by the edge of the frame.  It works good and feels sturdy, but you can't move it to alternate locations easily.  The part I didn't like were all the missing parts. There was no cap on the pen, so it arrived dried out and unusable. And I see no way to mount the pen to the board itself, unless that was somehow on the pen cap itself.  Probably would have given it another star if it arrived complete. The included magnets are pretty weak. Just ok overall, for my experience with it.", "overall": 3.0, "reviewTime": "05 5, 2014", "summary": "I've had better"}
,
{"reviewerID": "A1FMWLZ9YY91XI", "asin": "B00BH9GNYU", "reviewerName": "K. Kasabian", "helpful": [0, 0], "unixReviewTime": 1402531200, "reviewText": "I chose this primarily for its size, but the wood-like border dresses it up enough to keep in my cube at work. It's just the right size for my space. Because it's a little heavier than the plastic-framed boards, it has to be mounted with screws, which come with the product. This means you have to have the right kind of wall AND have a very good place for it, as moving it would mean having to drill two more holes in another wall. Recommended.", "overall": 4.0, "reviewTime": "06 12, 2014", "summary": "Sturdy, more handsome than others"}
,
{"reviewerID": "A2BYFGD27QAIOG", "asin": "B00BH9GNYU", "reviewerName": "Lee", "helpful": [0, 0], "unixReviewTime": 1401321600, "reviewText": "The Quartet Dry Erase board does i&#8217;s job well! This board comes with a small dry erase marker with a tiny eraser on the end as well as two magnets to hold small memo&#8217;s on the board.  Installation was a breeze as I simply put two nails in the wall, and hung the board up using the small brackets on the back.  I would totally recommend getting a pack of dry eraser markers instead of using the one that came with the board as the quality isn&#8217;t all that grand.  My niece decided to write all over it, and use it as her drawing board, and we found the marker that came with it tends to dry out quickly, so getting a good marker is a definite!  The magnets can only hold small pieces of paper, as they aren&#8217;t that strong, but I don&#8217;t normally use them anyway.  The board itself is easy to write on, and easy to wipe off, just remember that if you leave writing on for a while that it will stain, and you&#8217;ll have to use a cleaner to get it off.  I used a Magic Eraser, which took it right off, and it was clean as can be!  The size is perfect for my use, which is half work, half personal, and I couldn&#8217;t be happier with it!", "overall": 4.0, "reviewTime": "05 29, 2014", "summary": "Great Product!"}
,
{"reviewerID": "A2561PYW9TTMYD", "asin": "B00BH9GNYU", "reviewerName": "Lori Calabrese &#34;Children's Books Examiner...", "helpful": [0, 0], "unixReviewTime": 1403136000, "reviewText": "This is a great dry erase board. I've used it a lot and it's super easy to clean and doesn't leave stains. The board is easy to hang and I would definitely recommend it.", "overall": 5.0, "reviewTime": "06 19, 2014", "summary": "Great dry erase board"}
,
{"reviewerID": "A2VH0UT5EQFB6P", "asin": "B00BH9GNYU", "reviewerName": "Loveguitar", "helpful": [6, 7], "unixReviewTime": 1398211200, "reviewText": "This thing is great!  I didn't use the enclosed metal hangers, screws and molybolts to hang this board on the back of our kitchen door.  I used those 3M brand velcro adhesive strips instead and they are holding it very securely to the back of our metal, painted door.  I didn't want to make any holes and this board doesn't really weigh enough to merit such measures.We have already started using it to keep up with important phone numbers and dates of future events and appointments.  The marker that it comes with is o.k., it has a built in eraser and works but I will be using other dry-erase markers when it runs dry and just a soft cloth to erase the board with.  Two very strong magnets are included to use as needed, I guess to hold pictures or notes to the white board.Overall, this white board is doing exactly what I want it for.  I cannot see any faults whatsoever, and I expect it to last a long time.", "overall": 5.0, "reviewTime": "04 23, 2014", "summary": "Quartet Magnetic Dry-Erase Board 17\" x 23\"  Black Finish"}
,
{"reviewerID": "A3QZU3A1L17O3M", "asin": "B00BH9GNYU", "reviewerName": "Lulu Magoo", "helpful": [0, 0], "unixReviewTime": 1403136000, "reviewText": "This is an inexpensive dry erase board that works as expected despite arriving with several small dents in the boards surface. Couldn't tell if that happened as a result of the shipping process but that would be my guess.I don't really like the lack of built in hardware for hanging- as I'd like to sometimes move a board like this around the shop or classroom.", "overall": 3.0, "reviewTime": "06 19, 2014", "summary": "Good enough"}
,
{"reviewerID": "A36EW68H08UOCS", "asin": "B00BH9GNYU", "reviewerName": "Mark J. Fowler \"Let's Play Two!\"", "helpful": [0, 0], "unixReviewTime": 1401321600, "reviewText": "Okay - this board could only be improved if it was cork also!  I'm trying to rid the office of pins and sharp things since little ones visit, so every way we can use safe equipment, we try to do that.  This board comes with a few magnets (you can use your own, of course) plus a marker with a rub-away eraser on the other end.  If you're looking for one sized 17&#34; by 23&#34; (yeah... I thought those were odd measurements too...) you've come to the correct item!", "overall": 5.0, "reviewTime": "05 29, 2014", "summary": "Magnetic AND Dry-Erase?"}
,
{"reviewerID": "AMYTL79JMGQ6D", "asin": "B00BH9GNYU", "reviewerName": "Mary Ann", "helpful": [0, 0], "unixReviewTime": 1398556800, "reviewText": "This board has taken some review hits because one has no choice of frame--it will be either black or wood.  Well, mine is black and that is better than good for about $13, including a marker and two magnets.  The size is generous, at 17&#34;x13&#34;, and the surface that magnets will attach to is all to the good, too.  It is not very heavy, and that is plus, since these boards are often attached to doors and flimsy walls that do not need the stress of a lot of weight or tricky attachment methods.  This product fills the bill.", "overall": 5.0, "reviewTime": "04 27, 2014", "summary": "Nice board"}
,
{"reviewerID": "A1Y32FBX45NCNL", "asin": "B00BH9GNYU", "reviewerName": "Monique", "helpful": [1, 1], "unixReviewTime": 1403308800, "reviewText": "My daughter has this mounted in her bedroom. She's used it for reminders for upcoming school assignments, tests, and just to doodle.", "overall": 5.0, "reviewTime": "06 21, 2014", "summary": "Serves its purpose"}
,
{"reviewerID": "AONXNUE8RMO0M", "asin": "B00BH9GNYU", "reviewerName": "Noelle", "helpful": [0, 0], "unixReviewTime": 1405036800, "reviewText": "I wanted a magnetic dry-erase board to be sort of a multi-purpose, one-stop shop for all of the family's activities, important papers, notes, etc. So far, it has held up well. Early on, we noticed that the pen's magnet didn't really cling very well to the board, so we glued on an extra magnet and now it works fine.Word to the wise: hang the pen cap-down on the board, and the pen will work WAY better!", "overall": 4.0, "reviewTime": "07 11, 2014", "summary": "Hang the pen upside-down, and you're good to go"}
,
{"reviewerID": "A34VCCL1YO6D0I", "asin": "B00BH9GNYU", "reviewerName": "Peter Dykhuis", "helpful": [0, 0], "unixReviewTime": 1403136000, "reviewText": "Great item.  Attractive in my kitchen and cleans up easy with dry erase markers.  Included marker is nothing special but does the job.  Good bargain for the price.", "overall": 4.0, "reviewTime": "06 19, 2014", "summary": "Works as expected"}
,
{"reviewerID": "A27H0T39U3FZB5", "asin": "B00BH9GNYU", "reviewerName": "P. MSakamoto \"boy clothes\"", "helpful": [0, 0], "unixReviewTime": 1402444800, "reviewText": "I put this board up in my office at work. It is a nice size for notes and quick 1:1 conversations with drawings. the included pen and magnets work well. The surface writes and erases easily. The included pen has an eraser on it and it is magnetic so that it will store on the board surface. Nice.Why not four stars? Well, this board has NO chalk tray - at all. Now, I get that erasers are apparently on the outs, but I don't have all magnetic dry erase markers at the office. So, where do you put them? Just a skinny little tray would make this baby a five star, because it is easy to install, and writes and erases so easily.", "overall": 4.0, "reviewTime": "06 11, 2014", "summary": "Could use some sort of chalk tray"}
,
{"reviewerID": "A3006WHOAYJRLI", "asin": "B00BH9GNYU", "reviewerName": "Poogy", "helpful": [0, 0], "unixReviewTime": 1402876800, "reviewText": "This erasable board is the right size for a kitchen or workroom to keep track of chores or groceries to be bought; if you want something for office use or listing prices at a farmer's market, you'll want one twice as large.  Because it's magnetic, you can attach receipts or notes, so it doubles as a bulletin board.  The two magnets it comes with are weak, so you may want to use some of your collection of refrigerator magnets.It comes with a marker which is weakly magnetic, but it's very small and the line it writes with is too fine to be read at a distance, so you'll want to pick up some larger erasable markers.  Also, the only eraser it comes with is very small and is attached to the cap of the marker, so you'll need to get a better eraser, too.  Finally, while it's sturdy enough for indoor use, and comes with adequate mounting hardware, it's not designed to withstand the elements.  So it has many limitations, but for the price it's fine.", "overall": 3.0, "reviewTime": "06 16, 2014", "summary": "Adequate small, magnetic, erasable board"}
,
{"reviewerID": "A2L6QS8SVHT9RG", "asin": "B00BH9GNYU", "reviewerName": "randomartco \"period film aficionado\"", "helpful": [0, 0], "unixReviewTime": 1403136000, "reviewText": "Great solid dry-erase board, works great! I love the magnetic dry erase marker and two magnets that come with it - very handy. Writes well, erases well, easy to use, good construction, good price - nothing bad to say, I would recommend this to others :).", "overall": 4.0, "reviewTime": "06 19, 2014", "summary": "Solid, affordable and does its job well"}
,
{"reviewerID": "AEMSGB00FL3YO", "asin": "B00BH9GNYU", "reviewerName": "Sandra J. \"SJ White &#34;amazon shopper&#34;\"", "helpful": [0, 0], "unixReviewTime": 1400025600, "reviewText": "This 17&#34;x23&#34; Quartet Magnetic Dry-Erase Board is a perfect size for writing notes, grocery list, etc..  I had the smaller one but I really like the bigger size.  Be sure you measure where you want it before ordering!  I love the Magnets to hold notes.  It came with a erasable pen.  The one I got is framed in Oak which is perfect against my oak cabinets.  It comes with hangers to hang it and can be hung vertical or horizontal.  We recommend this highly.", "overall": 5.0, "reviewTime": "05 14, 2014", "summary": "Love the big size!"}
,
{"reviewerID": "A2SY92ZXU2FOEU", "asin": "B00BH9GNYU", "reviewerName": "sanoe.net", "helpful": [0, 0], "unixReviewTime": 1400716800, "reviewText": "I have a smaller dry-erase board for my desk but I wanted something bigger so when I came across this item, I selected it with barely a blink between a move and a click.And it is a perfect size for what I wanted it for. I wanted it for the wall at the bottom of the stairs so the family could write reminders or notes before they left the house. I like that the mount screws have the plastic fasteners as well so I was able to hang it securely. The dry erase pen has an eraser on the cap and I like that too. Such a small thing to add but very helpful.Now that I've had it almost a month, I think I want to order one for my home office too.", "overall": 5.0, "reviewTime": "05 22, 2014", "summary": "Perfect size for what I wanted"}
,
{"reviewerID": "A1I5GX6BWQB161", "asin": "B00BH9GNYU", "reviewerName": "Shlok Vaidya \"The Rise of Siri\"", "helpful": [0, 0], "unixReviewTime": 1399593600, "reviewText": "A handy addition to the kitchen. The roommates use it to communicate, and we keep the &#34;to buy&#34; list on there with a magnet. Cleans easily. The marker that came with it sucks, but that's to be expected. Good size for this use.", "overall": 5.0, "reviewTime": "05 9, 2014", "summary": "A handy addition"}
,
{"reviewerID": "A2UM324B00HBC8", "asin": "B00BH9GNYU", "reviewerName": "SierraC \"Celestial\"", "helpful": [1, 1], "unixReviewTime": 1398988800, "reviewText": "Overall size is 17&#34; x 23&#34; exactly as shown in the description, but I thought you'd want to know that the write-on white surface is 15&#34; x 21&#34;. The black frame adds 1 inch to each edge. The circular magnets are strong. The little dry-erase pen has a fine enough tip to allow you to write a lot on the board. The included hardware is strong enough to hold the less than 2 1/2 pound board to a wall or other surface. It's a very good-looking board. The surface is exactly what you would expect and erases easily. It is already my favorite of all my dry-erase boards.", "overall": 5.0, "reviewTime": "05 2, 2014", "summary": "15\" x 21\" white board with handsome black 1\" frame"}
,
{"reviewerID": "AOE0XMITAJWDT", "asin": "B00BH9GNYU", "reviewerName": "Terry Sunday", "helpful": [5, 5], "unixReviewTime": 1398988800, "reviewText": "What can I say about such a simple, everyday, low-tech item like this Quartet Magnetic Dry-Erase Board?Well, we called them \"WOWO boards\" in the acronym-crazed aerospace engineering biz (it stood for \"write on wipe off\"). It's far better to make notes on a WOWO board than on tiny scraps of paper that invariably end up scattered all over the place and go missing when you need them most. We'd been thinking about getting such a board for a long time, but for some reason never got around to it. Then this one showed up as a Vine program selection.Other than that, here are some specifics:At a size of 17 by 23 inches, this WOWO board is plenty big enough for household note taking. In fact, it's too big to hang in our kitchen because we don't have a big enough clear section of wall space for it, so we just lean it up against the island. I didn't use the included wall anchors and mounting bracket, which have now found their way into my hardware drawer.It seems pretty sturdy, even with just a thin cardboard backing, and the frame is straight and true.The included black felt-tip marker, with a broad eraser on the cap, is serviceable but a little underwhelming. It's very small, has a relatively fine point, and I suspect it won't last very long. It has a magnet on one side of the cap to hold it to the board for storage, a nice touch. When it dries out (which will be sooner rather than later here in the desert), I'll pick up a package of multi-color markers, which I think will be more useful.The two little round magnets, which I assume are intended to hold paper notes on the board, are a little weak for the job, in my opinion, but, again, they're serviceable.All in all, this WOWO board fills the need for which it was designed very well. It works fine for its intended purpose, and we've now become a little better organized for keeping track of shopping lists and household chores.", "overall": 4.0, "reviewTime": "05 2, 2014", "summary": "Adequate for the Job without Bells and Whistles"}
,
{"reviewerID": "A8QYRG7TW491B", "asin": "B00BH9GNYU", "reviewerName": "Thee~Classy~Gal", "helpful": [0, 0], "unixReviewTime": 1398988800, "reviewText": "I rated Quartet Dry Erase board 4 stars because it works well. The size is perfect and was happy amazon carries this. I have smaller ones but this is great for classroom use during centers or gathered closely.I like that it is magnetic and the wood finish brings warmth to the design. Overall, this is a good dry erase board.", "overall": 4.0, "reviewTime": "05 2, 2014", "summary": "Good board"}
,
{"reviewerID": "A3R19YKNL641X3", "asin": "B00BH9GNYU", "reviewerName": "Thomas Duff \"Duffbert\"", "helpful": [0, 0], "unixReviewTime": 1399161600, "reviewText": "The Quartet Magnetic Dry-Erase Board (wood finish frame - 17 inch x 23 inch) that I received via Amazon Vine is perfect for what I wanted in a white board for my office. It's classy, looks great, and has the side benefit of being magnetic.The board comes with a dry-erase marker included, and the cap is both an eraser and a magnet. I was able to start using it right out of the box. The two clear discs are magnets that can hold other items to the board. This is also a nice touch as I can put stuff on the board along with writing notes next to them. The 17&#34; x 23&#34; surface is pretty large, so there's plenty of room for me to make notes.The only thing to keep in mind is that this particular white board assumes you'll be screwing brackets into the wall for mounting. You could always buy your own sticky mounts if you don't want to put holes in the wall, but figure you'll need to take care of that before you can actually start using it.This is a very good white board choice for the features, look, and price. I like it...Disclosure:Obtained From: Amazon Vine Review ProgramPayment: Free", "overall": 5.0, "reviewTime": "05 4, 2014", "summary": "A classy white board for a home office..."}
,
{"reviewerID": "A1NS6O584WD5FJ", "asin": "B00BH9GNYU", "reviewerName": "William Polm", "helpful": [0, 0], "unixReviewTime": 1399939200, "reviewText": "This is an attractive medium sized whiteboard. The frame is plastic (I received the wood finish) but solid and not flimsy. The actual size of the writing space is 14.75 x 20.75&#34;.I haven't used it a lot yet, but when I write on it with the supplied little dryerase marker, it wiped off cleanly. The pen does have a little magnet on one side of the erase end that holds it to the board, just barely.  My grandson has been using the supplied marker for a couple of days, and already it is running out of ink, so I wouldn't count on it lasting very long.The magnets are not particularly strong. I would prefer magnets at least twice as strong. However, one of the supplied magnets will hold up a notebook-size sheet of 90 lb. paper, as well as a small stack of 6  4x6&#34; file cards. So they are serviceable.It does come with metal hangers, screws and molybolts for mounting on a wall. (I didn't  mount it.)Overall, a pretty good value for the money. A longer-lasting marker would add to the value.", "overall": 4.0, "reviewTime": "05 13, 2014", "summary": "Nicely put together, weak magnets."}
,
{"reviewerID": "A20L63B48RPSOH", "asin": "B00BH9GNYU", "reviewerName": "Wix", "helpful": [0, 0], "unixReviewTime": 1402790400, "reviewText": "I have this mounted in my kitchen with a list of chores and household rules for my three kids to review. So far it has erased fine and is in great shape several months later. I thought it was perfect, no complaints.", "overall": 5.0, "reviewTime": "06 15, 2014", "summary": "Cheap, simple and has survived three kids."}
,
{"reviewerID": "A1P9BVW2JB1OVL", "asin": "B00BH9GNVS", "reviewerName": "Auntie Annie", "helpful": [0, 0], "unixReviewTime": 1390953600, "reviewText": "This board is perfect for my needs. It is approximately the size of a piece of poster board and will sit on the floor or a table if propped. I promote readings and have a printed sign about the same size that lists our organization name, reading in progress, and invites the public in. I prop this board against the base of the easel holding my permanent sign. (It has little rubberized feet on the corners that keep it from slipping.) On it I list the name of the feature and any other pertinent information that applies only to one reading. The following months I can list a new feature. A pen, a tray to hold pens, etc. and two small magnets are included, as well as hardware for permanently affixing the board to a wall.", "overall": 5.0, "reviewTime": "01 29, 2014", "summary": "Perfect"}
,
{"reviewerID": "A27DITPCCZIVAH", "asin": "B00BH9GNVS", "reviewerName": "C. Ball \"An idea that is not dangerous is unw...", "helpful": [0, 0], "unixReviewTime": 1392854400, "reviewText": "I was expecting something a little more durable like a hard laminate board, but this was simply thin layers with a cardboard back assembled into a frame.  Two of the corners were broken off, I found one in the box but not the other which seems to tell me it was not whole at the time of shipping.  The broken corners resulted in the material in those corners being bent.  It was not salvageable and not something I could use for presentation which was the intended purpose.  I gave it three stars instead of one to be fair to the product.  Seeing the construction, I think its &#34;Okay&#34;, but not great quality.  The condition was unfortunate and result of a combination of the packaging and the quality of the board itself.  I do like that they managed to make this magnetic without making it heavy.  And it did come with some useful accessories.", "overall": 3.0, "reviewTime": "02 20, 2014", "summary": "Arrived broken"}
,
{"reviewerID": "AYDC7F9UF6EQX", "asin": "B00BH9GNVS", "reviewerName": "Cordelia", "helpful": [0, 0], "unixReviewTime": 1393459200, "reviewText": "This dry-erase board is the perfect size to install in a kitchen for home communications. In our home it has been used for everything from writing tonight's menu to keeping score of a game to appointment and homework reminders. The magnets come in handy, though I think I would prefer a separate bulletin board for that purpose; posting papers right on the white board seems a bit messy and limits the writing area. Very useful overall.", "overall": 4.0, "reviewTime": "02 27, 2014", "summary": "Great for home communication"}
,
{"reviewerID": "AQNX0WN00JEVE", "asin": "B00BH9GNVS", "reviewerName": "C. Thilmany", "helpful": [0, 0], "unixReviewTime": 1391126400, "reviewText": "This 24 x 36&#34; magnetic dry erase marker board is good for light-duty use.  It comes with 2 round magnets, 1 black dry erase pen which has an eraser on the cap, along with a magnet on the cap&#8217;s side, and a plastic tray to hold markers.  It also comes with 4 screws and 6 wall anchors for mounting, either horizontally or vertically.  With an aluminum frame, the entire thing is thin and weighs very little.The rounded corners are plastic.  The front cover snaps on and off with the screws mounted through the back portion of the plastic corners.  Mounting this to the wall was easy, but you will need a drill with a bit.  I would have preferred something more mobile, perhaps something that could have been hung from a picture or Command hook.  Since it is stationary, be careful you&#8217;re putting it in a place easily reached for writing.As expected, the marker wipes off cleanly.  We&#8217;re using this in a small office where it&#8217;s only written on once or twice a week.  The fact that the board is also magnetic has been a huge plus for us.  The marker tray, though, is somewhat narrow for a few markers and a regular-sized eraser.  I suggest either getting markers with built-in erasers, or getting a cloth that can be hung by the board.One of the plastic snap-on corner covers had broken off during shipping, but we glued it on after mounting the board.  This was sloppy packing on Amazon&#8217;s part and they were notified of the specifics and told me they&#8217;d address it for future shipments.  They did offer to replace this one, but we didn&#8217;t feel it was necessary.  Since this was an Amazon shipping issue, it doesn't factor in to my rating of the product.", "overall": 4.0, "reviewTime": "01 31, 2014", "summary": "Useful in our small office"}
,
{"reviewerID": "A3HQAPXAJV7PRX", "asin": "B00BH9GNVS", "reviewerName": "Diane Kistner", "helpful": [0, 0], "unixReviewTime": 1390521600, "reviewText": "This whiteboard is actually office-duty solid while still being lightweight. To install it, you must drill holes in the wall according to the clear instructions, and it is anchored by long screws. The grey caps on the edges then snap on to cover the screw heads for a clean look.The marker holder does not extend the whole length of the board; it's about a foot long but plenty wide. The marker that comes with the whiteboard has a nifty eraser on one end, and the two magnets stick well and are easy to lift and move. Of course, any magnets will work on it.When this first came, I thought how great it would be just stuck vertically to the bottom door portion of the refrigerator for kids to write on or horizontally on the side of a filing cabinet. Of course, as it's designed, this whiteboard won't stick to metal because there are no magnets on the back, but I'll bet you could easily glue (or screw) on some strong neodymium \"super\" magnets at the corners and it would hold it for that purpose. (There are magnets with countersunk holes now for this kind of thing.) There is also a recessed lip all around the edges, on the back side, that could be pressed into service to hang clips from as well.It's big enough to do some serious planning but small enough not to overwhelm a space. It might even work as a decent projector screen for somebody who can't afford the $150+ real thing. I can imagine making a sidewalk A-frame sign or even a \"human sandwich\" sign using two of these. If intended to be out in the weather, however, I think I would coat the cardboard backing to keep it from getting wet.A versatile product, in other words.", "overall": 5.0, "reviewTime": "01 24, 2014", "summary": "Cardboard back but not flimsy, can use it creatively"}
,
{"reviewerID": "A2OW1FKQFPIA5D", "asin": "B00BH9GNVS", "reviewerName": "DMD", "helpful": [0, 0], "unixReviewTime": 1393113600, "reviewText": "I was pleasantly surprised when this dry erase board arrived, as it's nicer than I expected it to be.  It is quite large and sturdy, and comes with a pen (with an eraser), two magnets, and a tray that attaches for holding your marker(s).  There is hardware included for attaching it to your wall--you need a drill for this, however.My decor doesn't lend itself to a big ol' whiteboard mounted on a wall, so we've been having fun using it as a free-standing board.  Recommended.", "overall": 4.0, "reviewTime": "02 23, 2014", "summary": "Nicer Than Expected"}
,
{"reviewerID": "A2L4ZGN7GZJ95T", "asin": "B00BH9GNVS", "reviewerName": "Jed Shlackman", "helpful": [0, 0], "unixReviewTime": 1390867200, "reviewText": "This Quartet dry-erase board is lightweight and magnetic, and it comes with a small marker and wall mounting brackets, as well as a small marker holder to clip on to the bottom and a couple magnet attachments. The frame is pretty solid except for the plastic corners which break off easily. The marker tray is on the small side, especially if you use thick markers. The board is easy to clean and seems like it will serve its purpose for many years. I would give it 5 stars if the corners were better designed and more durable.", "overall": 4.0, "reviewTime": "01 28, 2014", "summary": "A pretty good white board, cleans easily and not hard to install"}
,
{"reviewerID": "A25IYL8L9LZNH3", "asin": "B00BH9GNVS", "reviewerName": "Jimmie Lanley \"a homeschool mom\"", "helpful": [0, 0], "unixReviewTime": 1393027200, "reviewText": "The plastic gray corners are meant to pop off and reattach. The ideas is that you use wall anchors (four of them are included) to attach the white board to the wall at the four corners and then hide the screws with the little gray plastic covers. The problem is that one corner popped off and broke during shipment. And while I waited to get this hung up, two more popped off (even while the whiteboard was still wrapped in plastic). One managed to get lost. So now I have three corner covers instead of four and one is broken. I have actually decided not to hang this on my wall at all as it doesn't look pretty enough. I think I want something in a wooden frame that looks a bit classier.Also, there are small grid dots all over the board. I guess those are for writing a straight line? At first I thought my board was stained.", "overall": 3.0, "reviewTime": "02 22, 2014", "summary": "corners break easily"}
,
{"reviewerID": "A1Z0LTKUA6F94D", "asin": "B00BH9GNVS", "reviewerName": "J. Miller \"smurfybabe\"", "helpful": [0, 0], "unixReviewTime": 1394409600, "reviewText": "This is a sturdy board for home use, but I don't think it would hold up to an office environment.  I do like the fact that it's magnetic and the marker erases easily from the board.  Luckily it was not damaged in shipping for us, though I could see how the corners could easily break during shipping as there is no cushioning for them at all in the box.", "overall": 4.0, "reviewTime": "03 10, 2014", "summary": "Nice for home use"}
,
{"reviewerID": "A1DSRM2P0WGQNS", "asin": "B00BH9GNVS", "reviewerName": "J. Moore \"Zombie Prep Network\"", "helpful": [0, 0], "unixReviewTime": 1393459200, "reviewText": "I put this sucker up in my home office and I have a place to write, and a place to stick things with magnets. To be more realistic, my kids have a place to draw and hang their photos.The 2X3 size is perfect for a small home office it's 6 square feet of whiteboard action. The board is not as heavy as you might think. A couple of picture hooks will do the job.", "overall": 4.0, "reviewTime": "02 27, 2014", "summary": "Handy"}
,
{"reviewerID": "A1M1Y5UGONAW06", "asin": "B00BH9GNVS", "reviewerName": "Jody", "helpful": [0, 0], "unixReviewTime": 1393027200, "reviewText": "Although this board is a bit flimsy, it performs well.  I really like that it's magnetic, as I can use those little binder clip magnets with it to hold coupons and business cards.  Dry erase markers work well on it and the marks are easily wiped off.A couple of corners popped off of mine, but I just mounted it vertically.  This means the tray isn't usable, but that's OK.  It still works, and I'd rather have it than not.", "overall": 3.0, "reviewTime": "02 22, 2014", "summary": "Adequate"}
,
{"reviewerID": "A1IH7O6EL7SNBD", "asin": "B00BH9GNVS", "reviewerName": "J. Stroh", "helpful": [0, 0], "unixReviewTime": 1392681600, "reviewText": "I put this board up in my grandson's room and use it as a guide when he does good things, like going potty by himself, picking up his toys, eating all of his meals, being good, using good manners, etc.  I bought thing poster tape and made line and bought more magnets with happy faces on them.  Every time he does something good or positive, he gets a magnet in that line.  At the end of the week, if he has 20 or more happy face magnets, he gets to go to the store and pick out a small toy or book.  It is working out very well and can't wait until he gets a happy face magnet put on the board.All in all, the board is very light weight and hangs easily and is well constructed.  For what I am using it for it is perfect!  The board is good size and I can put 20 different chore/good things on it with no problem.  I bought extra dry erase pens and the pens marks come off easily.Absolutely no complaints about this board as it is perfect for what I needed it for!", "overall": 5.0, "reviewTime": "02 18, 2014", "summary": "Very nice magnetic dry erase board!"}
,
{"reviewerID": "ABUE0ALHKWKHC", "asin": "B00BH9GNVS", "reviewerName": "Kiwi", "helpful": [1, 1], "unixReviewTime": 1390521600, "reviewText": "This board came with two broken corner caps so there is no way I would be able to hang it by using screws through the caps. It also came with scotch tape residue on it which won't come off. I don't generally want to screw anything into a wall or door so this is not a feature I would use anyway. However, I do like products which come with a wire or picture hanging accessories so we can hang the product by a hook or what I refer to as a *wreath hanger.* There is no way to install one of these on the board. If you're using this board leaning up against a wall or in a window (like a restaurant), it would work fine.The actual board itself works well and the pen markings erase easily. It comes with a pen and a couple magnets but the pen holder slips off easily and is not big enough to properly hold an eraser. It should be bigger, and I assumed at first that it attached by magnetic pull, but it doesn't. There are no directions telling us how this pen holder attaches.I suggest much better packaging for this product and a few more intuitively placed accents. It's unusual that something this basic couldn't be done correctly the first time. This is not *rocket science,* as they say. (smiling)", "overall": 2.0, "reviewTime": "01 24, 2014", "summary": "It needs more features....."}
,
{"reviewerID": "A1IDWUYX4QXTUE", "asin": "B00BH9GNVS", "reviewerName": "Leslie", "helpful": [0, 0], "unixReviewTime": 1393027200, "reviewText": "The marker board is a generous size at 2 x 3 feet but still small enough to fit on the back of a door or an office wall. The surface is easy to write on and easy to clean. There is a small eraser on the cap of the market pen that is included with the board. The occasional use of a moist paper towel will clean it more thoroughly. It's also magnetic, which is a nice feature for pinning notes. Two magnets are included.One problem: The shipping packaging was inadequate. The board was enclosed in a cardboard box with very light padding. One of the plastic caps on the corner was broken. The caps are supposed to pop off to allow access to a hole for the mounting screws and then pop back on. This one needed to be glued back on. The board itself was in good condition and dent-free. It feels a little flimsy until it is mounted to the wall.One other thing to note: The only way to hang this board is with mounting screws. There are no hooks on the back, so it cannot be hung like a picture.", "overall": 4.0, "reviewTime": "02 22, 2014", "summary": "Generous size, basic marker board"}
,
{"reviewerID": "A3H0ZQ74ITU83J", "asin": "B00BH9GNVS", "reviewerName": "Mom and Teacher", "helpful": [0, 0], "unixReviewTime": 1390435200, "reviewText": "We have only had the board a week, but so far we are very happy. The magnets that come with the board have a good strength (stay attached, but come off with a gentle pull). The board also comes with one pen that writes well. So far the board has been very easy to clean.At this point, we do not want to attached the board to a specific wall so I cannot review that aspect.  We did attach the little shelf, which is larger enough to fit four dry erase pens. It would be nice if the shelf was a little bigger to fit an eraser, which I recommend buying.  The little one on top of the pen that comes with the board is just too small for this size board.", "overall": 4.0, "reviewTime": "01 23, 2014", "summary": "Very Nice dry erase board"}
,
{"reviewerID": "AKPYS9VSM3LNX", "asin": "B00BH9GNVS", "reviewerName": "moose_of_many_waters", "helpful": [0, 0], "unixReviewTime": 1390521600, "reviewText": "This is a lightweight dry-erase board, the kind you could put in your garage or somewhere around the house.  It's not designed for a real office where it would be used heavily by engineering types and math types (me).  You'd need something with a stronger frame and a bigger pen/eraser holder for that kind of work.The frame isn't sturdy.  Mine came with a damaged corner and, as a result, a partially damaged board.  The pen/eraser holder is small and made of plastic.  The board's surface does erase easily and cleanly.  The magnets do work.  The board comes with four screws and plastic anchors that work well.  It also comes with a tiny black pen that has a tiny eraser.  You'll almost certainly buy more pens and a real eraser.  For the money, this would be a decent purchase for light duty use.  Heavy users of dry erase boards will need something sturdier and more expensive.", "overall": 3.0, "reviewTime": "01 24, 2014", "summary": "For the price, it's fine"}
,
{"reviewerID": "A1UCPXUBSESD65", "asin": "B00BH9GNVS", "reviewerName": "mzglorybe", "helpful": [0, 0], "unixReviewTime": 1392854400, "reviewText": "First of all, it was just thrown into a box that was unsealed when it arrived. The board itself had a minor dent in it too, but not so bad we couldn't use it. One corner was missing however, a plastic piece that should've been included, but wasn't. The plastic seal around it doesn't allow for anything falling out, so it was overlooked. The flimsy tray for markers didn't want to stay in place, but we've got it reinforced now. The marker itself is lightweight with a small magnet on one side so it will stay on the board, we like that feature, but the ink itself is not as dark as other markers we've used.This was acquired through the vine program, for my honest review. In all fairness, I could not give this a good rating. It is pricey for the quality one gets. There must be something better out there. Also, for what it costs you'd think they'd provide you more than one marker and two flat magnets. These magnets are not very easy to lift from the board. I bought some of the higher profile ones that are easier to grab.We are using it in a laundry/mud room area that we just remodeled in white and gray, so it all looks nice together, that is the one good thing. We are getting by with it for now, but disappointed that it wasn't better made.", "overall": 2.0, "reviewTime": "02 20, 2014", "summary": "Expected more for the price."}
,
{"reviewerID": "A3EZFFPVS34AMO", "asin": "B00BH9GNVS", "reviewerName": "PD", "helpful": [0, 0], "unixReviewTime": 1393459200, "reviewText": "The Good:The first thing I noticed was how strong and inflexible this board is, and then I realized it the surface is a white metal sheet to allow magnets to work on it (I learn quick, huh?). That's a great feature because often these white boards tend to bow out and twist. The surface is white glossy which makes for easier cleaning (especially with Quartet's new markers that write smoother and clean easier... I did a review for those as well). The board comes with two magnets for holding papers, and of course you can add more. They hold quite tight, papers won't be skidding down on you. The tray to hold markers does mount on any edge which is nice, because I do have mine in vertical orientation.Overall, great board, love the stability and flatness of it.The Not-So-Good:The packaging is incredibly thin and the board arrived with one corner smashed. To add fuel to the fire, Amazon put NO packing whatsoever in the shipping box which was at least a foot longer than the board's box. That thing was basically banging around during the shipping process and the corner got crunched. I did get it to mount on the wall almost MacGyver style..The marker tray is a bit flimsy, and way too narrow and short. I have a set of 4 Quartet Chisel Tip markers on there now, and the tray is JUST long enough to hold two markers end-to-end. But, being I have 4 markers and two have to lay next to each other, it would have been nice if this tray was at least \" wider so both markers would lay flat. They almost do, but I know as sure as I write this that grabbing one marker will make the other fly off the tray, there is no wiggle room at all. This tray could have been a bit bigger and a bit long, at least to fit the very markers they make! It's definitely not wide enough for a bottle of spray cleaner and erasers, so that rules out using this in the office at work. It's fine for home use or on an easel at a luncheonette to display specials, etc, where a marker tray is not needed.To end on a positive note, the white surface does look really nice, and there are these very faint gray dots that you can barely see on the surface to create a grid so you can write (or magnetically mount papers) quite straight. Nice feature.", "overall": 4.0, "reviewTime": "02 27, 2014", "summary": "Quality Board, Bad Packaging, and You Call That a Tray?"}
,
{"reviewerID": "A105S56ODHGJEK", "asin": "B00BH9GNVS", "reviewerName": "Peace Daddy \"Eclectic ReflectionZ\"", "helpful": [0, 0], "unixReviewTime": 1393113600, "reviewText": "How much can you really say about a dry erase board? It works just fine, seems to be well made to stand up to time. I used dollar store dry erase markers and they wiped clean with no issues. We homeschool our kids so it will be put to a ton of use over time. If anything changes, I'll be sure to update this review.", "overall": 4.0, "reviewTime": "02 23, 2014", "summary": "It's a dry erase board."}
,
{"reviewerID": "A14EPTYN50XSZV", "asin": "B00BH9GNVS", "reviewerName": "Someone Else", "helpful": [2, 2], "unixReviewTime": 1392854400, "reviewText": "If this board were being sold at a rock-bottom price I might recommend it for someone who wants something extremely cheap but functional. However, at the time I requested this item, it was selling for about 35 dollars here on Amazon. At that price, you'd expect something of much better quality.When the board was delivered to my home, one of the plastic corners had already broken off, and there was a big dent in the board. You can't just pop the corners back on. They are attached with tiny, flimsy plastic pegs that break off when you're not looking. I had set the board in a spot where I could test it out for purposes of review. No one else went in that room. A few hours later, I discovered that another one of the plastic corners had fallen off, without anyone even having touched the board! The back of the board is just cheap cardboard, which is nice if you want a lightweight board, but doesn't provide much longevity.The pen that comes with it is a nice concept. It has a magnet to attach it to the board, and a little eraser on the end, which I love. However, the magnet is not strong enough to keep the pen stuck to the board, and most of the ink in the pen had already dried out before I got a chance to use it even once.I do not want to drill holes in my wall to hang something so poorly made, and it looks tacky with the two corner pieces missing. It will probably end up in the dumpster before too long.", "overall": 1.0, "reviewTime": "02 20, 2014", "summary": "Flimsy. Started Falling Apart Before It Arrived."}
,
{"reviewerID": "A3EFZZY5DUHLVS", "asin": "B00BH9GNVS", "reviewerName": "S. Rudge \"Always Even Steven\"", "helpful": [0, 0], "unixReviewTime": 1391558400, "reviewText": "I have put this white board to great use.  It works extremely well as a white board as you might imagine it would.I have purchased other white boards and never received a couple of magnets with them as I did with this one.  The magnets gave me the idea to hang the board vertically and use the magnets to attach posters and other art to it so I can photograph them.  The board is large enough (24\"x 36\") to hold your average size poster.The unit is solid yet light with all the hardware you need to attach it to a wall, permanently or temporarily.  As mentioned it comes with two magnets and other accessories. It arrives in fairly large box which wasn't very securely packed.  Nevertheless, the unit arrived undamaged.", "overall": 5.0, "reviewTime": "02 5, 2014", "summary": "Multi use - Good Quality - Light but Sturdy"}
,
{"reviewerID": "A2F09EWKV3MTO2", "asin": "B00BH9GNVS", "reviewerName": "StillWaters", "helpful": [0, 0], "unixReviewTime": 1393459200, "reviewText": "Overall this is a good board with everything you need. It has small dots on it to help you if you need to make lines or designs. It comes with the magnets and marker. Unfortunately, as another reviewer mentioned, the corners broke off making it difficult to nail to the wall. I didn't notice anything wrong with the packaging which leads me to believe the product needs to be made with better material.", "overall": 3.0, "reviewTime": "02 27, 2014", "summary": "Good quality but not perfect"}
,
{"reviewerID": "AOVTLYTHVDNUX", "asin": "B00BH9GNVS", "reviewerName": "Tradecraft \"Live by the Sword\"", "helpful": [0, 0], "unixReviewTime": 1390780800, "reviewText": "The Quartet Euro Frame Magnetic Dry-Erase Board is good for light use around the house but is not designed for heavy duty regular use. I keep mine in the laundry room where is it out of sight but works well. It is a great feature to be able to both write on the board and use the magnets to hold items. The board is very easy to hang, the magnets work well, and it came with one dry erase marker. The board can be hung horizontally or vertically so it is very adaptable to many locations. It works well.", "overall": 4.0, "reviewTime": "01 27, 2014", "summary": "Nice Dry-Erase Board"}
,
{"reviewerID": "A2AYDT1O1K8MG2", "asin": "B00BH9GNVS", "reviewerName": "W. Sanders", "helpful": [1, 1], "unixReviewTime": 1392076800, "reviewText": "The Quartet Euro Frame Magnetic Dry-Erase Board is great when your life is crowded and changeable. My wife and I set up our board next to the door that leads to the garage. To the single black dry erase marker that comes with the board, we've added a red and blue one. Black is for the usual things we need to remember (keys, phone, lunch), red is for appointments, and blue is for what to pick up at the store. In addition, we use the two magnets for coupons. If we come across a coupon for something we always get, rather than throwing it in the junk drawer (where it is promptly forgotten), we just slip it under a magnet. Then if we are going to the store, we can check the coupons and grab any we need.Setting up the board is pretty simple since it comes with screws and drywall anchors. I just drilled holes for the anchors and screwed the board to the wall. The tray that comes with the board mounts on the bottom where we keep the eraser and dry erase markers. For some houses, the board may seem pretty big for a reminder board, but the little white ones you can get can fill up pretty quickly and pretty soon you see all kinds of messages overwritten. Sometimes we'll place Post-It notes on the board to be taken with us--like a certain size battery (e.g., get AAA, not AA).All in all the board is easy to set up, useful and easy to clean off. It helps us.", "overall": 5.0, "reviewTime": "02 11, 2014", "summary": "Our On-The-Way-Out-The-Door Board"}
,
{"reviewerID": "A357B3PUHSVQA", "asin": "B00BH9GNVS", "reviewerName": "Y. R. Wu \"The will to win is nothing without ...", "helpful": [0, 0], "unixReviewTime": 1393113600, "reviewText": "We have several dry erase boards at home for keeping track of chores and all the comings and goings.  This one is quite nice in that it is also magnetic so you can hold papers to it easily.The board is nicely made (even though the backing material is corrugated cardboard, I don't think it's an issue)  There are mounting holes in the plastic corners that allow you to screw the board to the wall.  The mounting holes are then concealed by cover pieces so you get a clean look.My two criticisms are:1) The screws and drywall anchors supplied are huge!  I'm not mounting a flat screen TV - I ended up using drywall screws and some much smaller drywall anchors - the board is quite light light!2) Marker tray is disappointingly small.  Perhaps they wanted it to work even if you used the board in portrait mode, but even then it would be perhaps half the length of the board.", "overall": 4.0, "reviewTime": "02 23, 2014", "summary": "Excellent magnetic board with hidden fasteners.....pen tray is a bit disappointing"}
,
{"reviewerID": "A2VDZ27CMLJVVH", "asin": "B00FW6S1NA", "reviewerName": "Amber FLYNN", "helpful": [1, 1], "unixReviewTime": 1391126400, "reviewText": "I have used a LOT of Bulletin Boards in my life. What I like most about this board is that it is EXTREMELY Lightweight  and includes  4 permanent Self-Stick Pads that attache it to the wall.I opened the package and within 5 minutes the Board was on my wall and in use.  And for the price of $13.00 you just can't beat that!This board comes in 3 Frame Colors.  I have the Silver Frame and will put this board in my Garage.  But I have to say that the Black and White Frames are quite stunning and will order the White one soon.Great price, lightweight, and easy to hang!  What else would you want in a Bulletin Board?", "overall": 5.0, "reviewTime": "01 31, 2014", "summary": "Lightweight, hangs easily, looks beautiful!"}
,
{"reviewerID": "A38QHZEEYZKT27", "asin": "B00FW6S1NA", "reviewerName": "Amighty \"Celebrity Poker\"", "helpful": [0, 0], "unixReviewTime": 1391472000, "reviewText": "Do you need a place on your wall to stick notes and receipts and tickets, etc?  If you have your own pushpins then this is for you.  It comes with it's own &#34;permanent&#34; double-sided tape for mounting it on the wall.  The &#34;silver frame&#34; is actually just gray plastic, making the whole thing very light and flimsy.  It works though and doesn't look bad at all, I just wouldn't design the whole room around it.", "overall": 3.0, "reviewTime": "02 4, 2014", "summary": "A flimsy but functional cork board"}
,
{"reviewerID": "A2IPC51HL9UUYF", "asin": "B00FW6S1NA", "reviewerName": "Amy Y. \"Tell me, what is it you plan to do wi...", "helpful": [2, 2], "unixReviewTime": 1391299200, "reviewText": "This cork board is inexpensive and you get what you pay for.  The frame is not really 'silver', more like plastic painted grey.  The plastic frame isn't even decent quality for being plastic.On the plus side?  This cork board weighs next to nothing.  If you don't have a secure place to hang it, no fear!  If it falls off the wall, it probably won't do too much damage.  It may even float to the floor if there is a bit of a draft!This could make a good cork board if you needed something portable?  It is pretty good sized (2 ft x 1 1/2-ish feet) but it is really lightweight so I would say highly portable.  Caution!  I think this could fold/bend pretty easily.Downsides?  This is not an aesthetically pleasing bulletin board (if there is such a thing)- mostly because the frame is so glaringly cheap.  Another problem?  If you put anything slightly weighty on it, you may have problems with it staying on the wall as you will also be hanging it from the ultra aforementioned cheap-o frame.All in all?  If you don't care what it looks like or if it will stay on the wall, this may be the perfect bargain for you.  If you want something that lasts and will hang decently on the wall (and not going winging down into the crack behind your desk every time a door closes anywhere on the block), you can probably hold out for a far superior item for a couple dollars more.", "overall": 2.0, "reviewTime": "02 2, 2014", "summary": "Meh.  (I know, crazy, 'cuz how hard is it to make a 'meh' cork board?)"}
,
{"reviewerID": "A2I05FGBTCRRB8", "asin": "B00FW6S1NA", "reviewerName": "anon \"anon\"", "helpful": [0, 0], "unixReviewTime": 1392076800, "reviewText": "My daughter loves putting up cork boards in her room to tack up all kinds of little things she likes, from magazine snippings to photos of her and her friends, and so forth. This bulletin board is nice. It seems sturdy. The only thing is that the hanger it comes with says it's permanent tape. So who knows what it will look like someday when we go to take it down. But I am sure she'll be leaving it up for quite some time, so I am not really going to worry about that right now. Maybe it will just need a little touch up of paint or something. It would be nice if they were more like removable strips or something, but for an inexpensive cork board, I guess you get what you get.", "overall": 4.0, "reviewTime": "02 11, 2014", "summary": "Nice Board"}
,
{"reviewerID": "A37RIRXE3WECZ", "asin": "B00FW6S1NA", "reviewerName": "April Blake", "helpful": [0, 0], "unixReviewTime": 1393372800, "reviewText": "Well, this is a bulletin board.  It's one of those things that doesn't need to call attention to itself all the time when it's just doing its job.  This bulletin board is easy to hang, is fairly lightweight, and makes a nice place to pin up inspiration, notes, small art projects.  If you're creative and want to doll it up, you can use some paint and paint the cork surface.  Or you can tack up some pretty colored paper to use as a background.  So it's a functional workhorse, this bulletin board.  Something simple that does its job.  I like it!", "overall": 5.0, "reviewTime": "02 26, 2014", "summary": "It's a Bulletin Board!"}
,
{"reviewerID": "A2C8W1VCVWPY13", "asin": "B00FW6S1NA", "reviewerName": "booksy", "helpful": [0, 0], "unixReviewTime": 1390608000, "reviewText": "This board is very lightweight and a great size, it's not too big so it can fit in a lot of tight places, yet it's not too small that you can't stick a lot of stuff on it. The tape that is supplied with it is very strong. I hung it on the side of my refrigerator with no problems.The price is very good for the quality of this product. I would definitely buy from this brand again. One note is that the photo that Amazon supplies for the product shows a darker frame, but in actuality it's an aluminum-colored plastic. Kind of ugly, but as long as it works that's okay with me.Recommended.", "overall": 5.0, "reviewTime": "01 25, 2014", "summary": "Great Value"}
,
{"reviewerID": "A2GA64WZK8PKBC", "asin": "B00FW6S1NA", "reviewerName": "Cat Feet", "helpful": [0, 0], "unixReviewTime": 1391644800, "reviewText": "I concur with the other reviewers in that this cork board is \"OK\" but not made to last. It's super lightweight to accommodate those nasty sticker things on the back. I honestly can't imagine anyone using those unless you park this thing on the wall FOREVER. Who knows what might grow behind this board if that's your choice (in my house the spiders will take up residence). That's why the plastic is flimsy, it has to be lightweight for sticker thingys to work, or it would come crashing down. The thinness of the cork-board is (unfortunately) the same story. So.. don't you dare consider pinning anything much bigger than a sheet of paper or a post it, heavier items and push pins need not apply. I don't have much hope for this board to last longer than 6 mo, maybe a year if I'm super careful with it. That's an odd thought since it's not a delicate bone china tea cup, it's a cork board for Pete's sake!My recommendation is to either spring for a better quality board, or consider this one's life span to be short and keep your expectations realistic. I actually found a board on Amazon that is less than $10, and hangs like a picture and I intend to buy it since it has several great (bonafide) reviews. Whatever you do, don't use those sticky things! I doubt those will hold up well with weather or humidity changes, and they will destroy whatever wall finish you have, regardless, when you try to remove the board. I wanted to use this board in my office, not on my fridge. I believe that's the only place you can hang it this way and not damage what you're hanging it on.3 stars is the best I can offer, and I feel that's being generous.", "overall": 3.0, "reviewTime": "02 6, 2014", "summary": "Well, yeah...it gets the job done and no more...."}
,
{"reviewerID": "ATJV9TWMRNF8K", "asin": "B00FW6S1NA", "reviewerName": "Cathe Fein Olson", "helpful": [0, 0], "unixReviewTime": 1393200000, "reviewText": "This bulletin board is definitely not high quaility with its plastic frame, cardboard backing, and thin cork board. The cork was damaged just opening the package.I don't have high hopes of this lasting very long in my teenage daughter's room. So far it has stayed up on the wall with the adhesive strips (1 week), probably because it's so lightweight. If you are looking for durablity,however, I'd look elsewhere.", "overall": 3.0, "reviewTime": "02 24, 2014", "summary": "pretty flimsy product"}
,
{"reviewerID": "A1AZ1NXGGP6LDX", "asin": "B00FW6S1NA", "reviewerName": "Christine Parker \"Love to Read\"", "helpful": [1, 1], "unixReviewTime": 1390521600, "reviewText": "The cork part is fine.....and that is it.  The outside is framed in plastic and the 3m double sided stickies are very sticky.  It will pull the paint right off the wall if you try and reposition it.  It is flimsy.  I have other cork boards that are surrounded by a wood frame and they are much sturdier.  Cheap quality.", "overall": 2.0, "reviewTime": "01 24, 2014", "summary": "The cork part is fine"}
,
{"reviewerID": "A3950CIY7HJZS8", "asin": "B00FW6S1NA", "reviewerName": "Corban Storm", "helpful": [0, 0], "unixReviewTime": 1393459200, "reviewText": "This cork bulletin board works if you need something inexpensive for the size given. It mounts to the wall with included adhesive strips, which secure it firmly to the wall (even mine, which is textured). Even with heavier items pinned to this, there appears to be no concern of it coming off the wall. The frame is sufficiently durable plastic of decent thickness.One consideration is the fact that its back of it is essentially cardboard, and when I penetrate the front cork with a longer push-pin, I feel that it does reach beyond the cork and into the cardboard. Not sure if this will have an impact after many times pinned and unpinned.", "overall": 4.0, "reviewTime": "02 27, 2014", "summary": "No frills, but works"}
,
{"reviewerID": "AC0HPFQVBZVGY", "asin": "B00FW6S1NA", "reviewerName": "Daniel Lee Taylor \"dan57\"", "helpful": [0, 0], "unixReviewTime": 1393027200, "reviewText": "I got this item to replace a smaller cork board that I had been using for hat and lapel pins I collect.  It is of a good size and well constructed.  It does come with adhesive pads for hanging.  The one disapointment might be my own fault.  The description said silver frame so I expected a metal frame.  It comes with a plastic frame not metallic. Other than that issue the board meets my expectations.", "overall": 4.0, "reviewTime": "02 22, 2014", "summary": "Nice little bulletin board."}
,
{"reviewerID": "A3MSB482DIB9SL", "asin": "B00FW6S1NA", "reviewerName": "David Zampino \"21st Century Hobbit\"", "helpful": [0, 0], "unixReviewTime": 1393286400, "reviewText": ". . . with the advantage of not having to drill into the wall to set up.Eight kids.  Busy schedule.  This is easily workable.Need I say more?", "overall": 4.0, "reviewTime": "02 25, 2014", "summary": "Fully functional . . ."}
,
{"reviewerID": "AGNPOWQ5M3FGW", "asin": "B00FW6S1NA", "reviewerName": "Diane Holm \"The Readers Cove\"", "helpful": [0, 0], "unixReviewTime": 1391299200, "reviewText": "I really liked this bulletin board.  I was light weight and easy to handle.  It mounted on my sliding closet door with ease.  The frame allows you to tuck things in like special tickets and push pins work great!", "overall": 5.0, "reviewTime": "02 2, 2014", "summary": "Light Weight"}
,
{"reviewerID": "A1I477ADGMLVJM", "asin": "B00FW6S1NA", "reviewerName": "D. Matlack \"Guidedog\"", "helpful": [1, 1], "unixReviewTime": 1390521600, "reviewText": "This is a nice light weight cork board with a plastic frame that is ideal for my craft room with one problem. Quartet only provides adhesive tape for hanging, NO hooks, just tape so that it can be permenantly affixed to a wall. Why any company would think it is a good idea to compromise your drywall with this is a mystery, but I am getting very tired of having to purchase my own hooks and hangers as an extra.Step it up Quartet!", "overall": 3.0, "reviewTime": "01 24, 2014", "summary": "No wall hooks just tape - Hope you like it exactly where you put it."}
,
{"reviewerID": "A2OW1FKQFPIA5D", "asin": "B00FW6S1NA", "reviewerName": "DMD", "helpful": [0, 0], "unixReviewTime": 1393113600, "reviewText": "Since I already own a heavy, beautifully-made framed cork bulletin board, I was a little disappointed when this product arrived.  The cork is very thing and flimsy, and the frame is just thin strips of plastic. It barely weighs anything at all.  From a distance I think it looks ok, and is probably better suited to a kid's room than part of one's home office decor.To hang, you use the supplied permanent adhesive strips.  Permanent?  As in \"I want this on my walls forever?\"  Sorry, there is nothing that I want to keep on my walls forever.  For items like this, I recommendCommand Picture Hanging Strips, 4-Small, 8-Medium.  They work great and are easily removed.Overall, while this cork board isn't horrible, I don't see any reason to recommend it, either.", "overall": 3.0, "reviewTime": "02 23, 2014", "summary": "Flimsy, Average Corkboard"}
,
{"reviewerID": "A3TNZ31U9DD7UE", "asin": "B00FW6S1NA", "reviewerName": "Dr A \"A reader of biographies, history, and o...", "helpful": [0, 0], "unixReviewTime": 1391817600, "reviewText": "A smallish bulletin board, very functional.  It comes with stick-on tape, which I didn't use - just leaned against the wall on top of my bookshelf.  I added felt pads to the back to avoid scratching the wall.", "overall": 4.0, "reviewTime": "02 8, 2014", "summary": "Simple and functional"}
,
{"reviewerID": "A3VBXQKRM7A4JR", "asin": "B00FW6S1NA", "reviewerName": "eyecore", "helpful": [0, 0], "unixReviewTime": 1393372800, "reviewText": "You can stick thumbtacks into this to hold up paper.  So, it does the job its supposed to do.  I also recently received a dry erase board - an inexpensive one - and it came with markers.  This bulletin board didn't come with a single tack.  Come on guys, don't be so dang cheap.Speaking of cheap, let's get back to this bulletin board.  I haven't torn it apart yet because just from feeling it, I'm fairly confident that will happen by itself.  However, there's a fair likelihood that the cardboard backing on this thing is thicker than than cork itself.  And combined, they still don't produce a thick enough backing to not have thumbtacks protruding out the back.So while tacking things on (while on the couch, before hanging it up), the tips of the tacks were scraping against the pleather couch.  Pretty sweet.Overall, this does it's job for the most part, but looks like every possible savings in manufacturing was done, and isn't exactly attractive, either.", "overall": 3.0, "reviewTime": "02 26, 2014", "summary": "Mostly functional, very unimpressive"}
,
{"reviewerID": "A2KMY4RVMJ1EP6", "asin": "B00FW6S1NA", "reviewerName": "faeriemyst", "helpful": [0, 0], "unixReviewTime": 1397433600, "reviewText": "Adequate for moderate use, Quartet's bulletin board is pretty thin and very light-weight, so I can't see this lasting for very long if it's used near everyday. The plastic frame is rather cheap looking too. I find the price rather high for what you get, which is a cork bulletin board that most likely will have to be tossed sooner rather than later. On the plus side, it does include self-sticking strips and magnets, but overall, I'm not very impressed.", "overall": 3.0, "reviewTime": "04 14, 2014", "summary": "Functional but may not last the long run"}
,
{"reviewerID": "A1I8XTYJHWX6N2", "asin": "B00FW6S1NA", "reviewerName": "Gypsi Phillips Bates \"bilbiophile\"", "helpful": [1, 1], "unixReviewTime": 1393372800, "reviewText": "This bulletin board is a nice size (17 x 13 inches) and the cork material holds push pins well.  It came with adhesive to attach \"permanently\" to the wall, but for the sake of our paint, I chose not to do so.  It is light weight, and as such it was easy to hang it on the wall with push pins; it has hung there successfully for three weeks.I was disappointed with the quality of the frame, however.  It is a molded plastic frame, which has a cheap appearance.  Mine, in fact, was cracked on arrival.  Based on this, and on the fact that there are less expensive wooden framed cork bulletin boards available, I can only give this a three star \"it's okay\" rating.", "overall": 3.0, "reviewTime": "02 26, 2014", "summary": "It's Okay"}
,
{"reviewerID": "A221I9R7I92ORO", "asin": "B00FW6S1NA", "reviewerName": "IRG", "helpful": [0, 0], "unixReviewTime": 1392768000, "reviewText": "If you're looking for a cork board that can be hung and on which you can mount a lot of things, this is not the cork board for you.If you're looking for a lightweight corkboard that is portable and that you won't be mounting (temporarily or permanently), this might work for you.For your consideration:Pros:&#62;Lightweight and small in size, so very portableCons&#62;Very cheap looking plastic frame with obvious seams. Gray toned color, not the &#8220;silver&#8221; as in description.&#62;Flimsy if you&#8217;re trying to use it to hold anything but sheets of paper or photos. Can&#8217;t hold all that much&#62;Limited options for mounting. (You can&#8217;t hang. Board comes with permanent sticky pads that may not adhere to some surfaces or not stay on for long; could cause damage to surface when removing (or trying to remove).&#62;description says it comes with magnets. No magnets nor would they work as the frame is cheap plastic.&#62;Cork is too thin for push-pins that are more than standard length. (Many popular ones have longer pins that would pierce thru this board.)&#62;Price. Would be cheaper to get that lightweight foam board because it could more easily be mounted or hung and it also allows you to use push pins of any size and can hold post-it notes, which this board cannot. Plus foam board can be bought in oversized pieces that can be cut down or in various other sizes and can even be &#34;doubled&#34; if you want to attach heavy items.Simply NOT a good value.", "overall": 2.0, "reviewTime": "02 19, 2014", "summary": "Cheap-looking cork board that cannot be hung, only mounted with sticky tape that may not adhere to surface"}
,
{"reviewerID": "A3C6CZC2JP67VK", "asin": "B00FW6S1NA", "reviewerName": "Jenny J.J.I. \"A New Yorker\"", "helpful": [1, 1], "unixReviewTime": 1393200000, "reviewText": "I gave this board to my teenage daughters and they use for pictures and post notes reminders. This product does the job for what its use for and like the reviewer stated from the description it says the board comes with magnets but never receive any. The &#34;silver&#34; frame might look nice in the picture but it&#8217;s just standard gray instead of silver. Size wise  its good and it fits behind their door. You pretty much get what you pay for really. Plus there are lots of other options that are built better right in the same price range. Overall good standard board.", "overall": 3.0, "reviewTime": "02 24, 2014", "summary": "Not bad"}
,
{"reviewerID": "A9GPCR9WJQCCJ", "asin": "B00FW6S1NA", "reviewerName": "Jim \"gearhead4\"", "helpful": [0, 0], "unixReviewTime": 1391212800, "reviewText": "Nothing fancy or high-tech here. It's just a cork board with a plastic frame. It is small and  light weight, so the mounting tape and magnets that are included will hold it in place on your refrigerator, wall or door.As a minimaliist, I like this simple and useful cork board. The down side is it's small size means it won't accommodate your average poster.", "overall": 4.0, "reviewTime": "02 1, 2014", "summary": "Fortunatly it doesn't take a quartet to hang this bulletin board"}
,
{"reviewerID": "A7RFDGVXDYQLJ", "asin": "B00FW6S1NA", "reviewerName": "JJ \"avid reader\"", "helpful": [0, 0], "unixReviewTime": 1390435200, "reviewText": "I put this super lightweight cork board on my refrigerator and love that it is not heavy and cumbersome.  It also came with double sided stickers that were very easy to deal with.  I now have a very visible handy place for all my reminders and of course pictures of the grandkids and pets.  This is perfect for board for me since I have trouble remembering appointment etc.  They are in front of my face every time I go to the fridge, which is several times a day.", "overall": 5.0, "reviewTime": "01 23, 2014", "summary": "Lightweight & Handy!"}
,
{"reviewerID": "A17D8RDGKBZ5TX", "asin": "B00FW6S1NA", "reviewerName": "John W. Loftus", "helpful": [0, 0], "unixReviewTime": 1393459200, "reviewText": "I have found that the stickers to put it on the wall are very strong. The downside is that I think it will tear off the wallboard paper when I take it down. It's a useful office tool just the same. Just make sure you level it before sticking it up and that you don't plan on moving it.", "overall": 4.0, "reviewTime": "02 27, 2014", "summary": "This buletin board is a good one."}
,
{"reviewerID": "AOAOARIH72UWI", "asin": "B00FW6S1NA", "reviewerName": "jt", "helpful": [0, 0], "unixReviewTime": 1391212800, "reviewText": "Tough to be too hard on this thing since it does advertise itself as &#34;Not flashy, but fully functional...&#34;  Having said that this cork board really is just ok and nothing special.  It is very lightweight which allows you to use the included adhesive pads to mount the board.  I would have liked to have the option of using screws or hooks.  I know that these sticky pads can take the paint right off your walls.  I definitely would not use the included pads on drywall.  There are no holes or other mounts to receive a screw or nail head.  Also, description says the board comes with magnets but, I did not receive any.  The &#34;silver&#34; frame is really just a plastic grey.  I don't think anyone would confuse it for silver.  The board itself is a nice size in that it fits behind our pantry door and does its job.  The only that would really sway me to purchase this board over another would have to be price.  There are lots of other options that are built better right in the same price range as this one.", "overall": 3.0, "reviewTime": "02 1, 2014", "summary": "\"Not flashy...\" is right.  Just a sub to mediocre cork board"}
,
{"reviewerID": "AJNW2SVETWAW1", "asin": "B00FW6S1NA", "reviewerName": "kacunnin", "helpful": [1, 1], "unixReviewTime": 1390867200, "reviewText": "The QUARTET BULLETIN BOARD is a small, plastic-framed corkboard which can be mounted on any smooth surface with the \"permanent self-stick pads\" (included).  It's easy to hang, very light-weight, and provides an adequate surface for posting notes, photos, business cards, etc.  The cork is quite thin (I have other bulletin boards in my home with much thicker cork), which might be a problem in hanging heavier items (a calendar, for example), but for most purposes it's adequate.But, keep in mind that the \"self-stick pads\" which are used to mount the bulletin board are PERMANENT.  Once hung, this can't easily be removed - and the sticky pads can damage walls, or leave residue on refrigerators and file cabinets.  Had this come with magnets, it would have worked in my kitchen (I currently have an old calendar/bulletin board combo unit hanging on the side of my fridge with magnets, and I was hoping to replace it with this).  But I won't permanently attach something like this to my refrigerator.So, I'm using it in my husband's office, although I'm not happy about the inability to move it or remove it easily.  When I was hanging it, I lightly placed it against the wall, hoping to be able to adjust it before pressing (the instructions say to press hard to secure the bulletin board).  But as soon as it touched the wall it was impossible to move.  Luckily, it appears to be even.  But I can see this being a potential problem if you aren't careful.Overall, this is a decent little bulletin board for a very reasonable price.  Just be sure you want the thing placed permanently before you hang it.", "overall": 3.0, "reviewTime": "01 28, 2014", "summary": "Nice little bulletin board, but self-stick hangers are PERMANENT!"}
,
{"reviewerID": "A30R8VFR16RE32", "asin": "B00FW6S1NA", "reviewerName": "Kristin", "helpful": [0, 0], "unixReviewTime": 1394755200, "reviewText": "This is a pretty flimsy cork board.  It has a plastic frame with molded flat pads on the corners of the back, and mounts via foam type double sticky back tape, which is provided.Don't hang anything heavy on this, or handle it too much, or it will fall off of the wall.", "overall": 4.0, "reviewTime": "03 14, 2014", "summary": "Good for a child's room with light use--not for heavy use."}
,
{"reviewerID": "A1QT3N5FUQ4I47", "asin": "B00FW6S1NA", "reviewerName": "lainibug", "helpful": [0, 0], "unixReviewTime": 1395100800, "reviewText": "This is a basic lightweight cork board that seems it will hold up well to gentle home use. The black frame is plastic but not unattractive and should be fine most anywhere you'd want a plain cork board. Given that the self-adhesive strips are described as permanent I'm a little concerned about wall damage when it's time to remove, but I haven't tested their removability since they're one-time use. Just note the word &#34;permanent&#34; and be ready to hang another way if that's a problem.", "overall": 4.0, "reviewTime": "03 18, 2014", "summary": "lightweight, basic"}
,
{"reviewerID": "ABLV9L4MQO7ER", "asin": "B00FW6S1NA", "reviewerName": "Matthew R. Kuiper", "helpful": [0, 0], "unixReviewTime": 1393200000, "reviewText": "Really enjoying this corkboard. I find it to be durable and attractive. I have a cluttered office and I really enjoy being able to put things of urgency on this board. I think you will find this to be a good fit for your office needs.", "overall": 5.0, "reviewTime": "02 24, 2014", "summary": "Quality board masculine appeal"}
,
{"reviewerID": "AC6LV5D2RKTIR", "asin": "B00FW6S1NA", "reviewerName": "Michigoon \"tech geek\"", "helpful": [0, 0], "unixReviewTime": 1391040000, "reviewText": "The cork is of good quality, small grain size so you shouldn't have any issues sticking things on. The small plastic frame is unobtrusive, and it comes with some pads to stick it on the wall. I could complain that the pads are not the temporary &#34;command hook&#34; style holders but permanent stickers, but I think that's unnecessary. If you need other hanging solutions, go get one, this is a fine board.", "overall": 5.0, "reviewTime": "01 30, 2014", "summary": "It's a corkboard"}
,
{"reviewerID": "A1WXG10FJ353K0", "asin": "B00FW6S1NA", "reviewerName": "MickeyJoe", "helpful": [0, 0], "unixReviewTime": 1395187200, "reviewText": "Currently at 13 bucks is too much.  There are 4-5 star options for less. Even this brand, Quartet, has a cheaper better quality board with a wood frame.But if you want something very thin, lightweight with a cheap &#34;silver&#34; (color, not metal) plastic frame, it's fine.There is no mounting hardware, just some 3M sticky pads to peel and stick. So there is no hook or way to hang it unless you want the foam stickers on your wall.  The back is thin, so you can't nail in your own hardware.  I tried stapling string on the back, but it is not secure.  So your only option is to use the stickers.You can only use basic tacks.  Push pins are just okay, and feel like they could pop through the back.  Drop the thing and it's history.  Under 10 bucks would be still pushing it.  Disposable at best. 3 stars is generous.", "overall": 3.0, "reviewTime": "03 19, 2014", "summary": "Basic thin plastic cork board."}
,
{"reviewerID": "A1M92239OM8KPO", "asin": "B00FW6S1NA", "reviewerName": "momofmany", "helpful": [0, 0], "unixReviewTime": 1394064000, "reviewText": "It's lightweight and easy to hang. I didn't use the included adhesive squares to hang it, because I haven't had good experience with those coming off cleanly. I used Command Strips and they worked fine.", "overall": 4.0, "reviewTime": "03 6, 2014", "summary": "Good Board."}
,
{"reviewerID": "A3LN4AOPBIUQWR", "asin": "B00FW6S1NA", "reviewerName": "N. Glenn \"Glenn.\"", "helpful": [0, 0], "unixReviewTime": 1391990400, "reviewText": "This is a very nice size cork bulletin board, big enough to hang large items on as well as fitting many smaller post its or photos. The frame is sleek and attaches to the wall with sticky backed foam pieces, I opted to use command strips for easier removal and less wall damage. I wish that this came with at least a dozen or so push pins to allow immediate use instead of having to order them separately.", "overall": 5.0, "reviewTime": "02 10, 2014", "summary": "Simple and efficient"}
,
{"reviewerID": "AB399AECXCDT8", "asin": "B00FW6S1NA", "reviewerName": "Patrick Regan \"Patrick Regan\"", "helpful": [0, 0], "unixReviewTime": 1393891200, "reviewText": "I could see the Quartet Cork Bulletin board being used in a dorm room by a college student, or for travel by someone who has to give presentations on the go. The price of this board and its overall sturdiness would have appeal to a college student and the fact that this board is extremely light would be a plus for the traveler who needs to make a presentation. This bulletin board has a plastic protective frame rather than the usual metal or wood frame; this is the main reason why the bulletin board is so light and probably is a factor in its low price also. Overall, I recommend this bulletin board for the above uses, but, if you have a little more money, there are other more attractive options to consider.", "overall": 5.0, "reviewTime": "03 4, 2014", "summary": "the advantages of this Cork Bulletin are its price and its extremely light weight"}
,
{"reviewerID": "A5I3B25LKW8GK", "asin": "B00FW6S1NA", "reviewerName": "Portianay \"portianay\"", "helpful": [0, 0], "unixReviewTime": 1394755200, "reviewText": "I find it difficult to wax eloquent about something this utilitarian, but I will just say: it works, it looks the way one expects it to look, and it does the required job, that of being a pin-pushable backdrop for reminders.", "overall": 3.0, "reviewTime": "03 14, 2014", "summary": "Works"}
,
{"reviewerID": "A1JOANG98KBFKU", "asin": "B00FW6S1NA", "reviewerName": "Rachel Himes", "helpful": [0, 0], "unixReviewTime": 1395187200, "reviewText": "I have several of these in my home for a number of purposes. Some are heavy and sturdy and some are cheap and light.This one is definitely in the &#34;cheap and light&#34; category. The corners don't meet up evenly and the cork is very light and shows pin holes quickly.  For the price, I can get one at my local super store that is a bit nicer looking with a more decorative frame.Still, it's not bad if you just need something to &#34;get the job done&#34; and don't care much about aesthetics.The light weight is an asset if you want to use the included sticky tabs to fasten it to a wall or the side of a fridge securely so it won't be knocked down frequently.", "overall": 3.0, "reviewTime": "03 19, 2014", "summary": "Just okay. Nothing fancy, nothing horrible."}
,
{"reviewerID": "A8WAYVOKYBLO6", "asin": "B00FW6S1NA", "reviewerName": "Rane E Stark", "helpful": [0, 0], "unixReviewTime": 1391385600, "reviewText": "The quality is fine. The cork is uniform and thick enough to hold the pins without any problems. The plastic frame is simple, but it does what it needs to do. The only real problem with this is that the only mounting &#34;hardware&#34; included is permanent adhesive. It might be fine for some applications, but hanging brackets would have made much more sense. It is not even as simple and buying your own and using them, because there really is nowhere on the back to mount them.If you are comfortable with sticking this somewhere permanently, then it is a fine product.", "overall": 3.0, "reviewTime": "02 3, 2014", "summary": "Fine"}
,
{"reviewerID": "A1EHDVLCSOU57Q", "asin": "B00FW6S1NA", "reviewerName": "redhedhs", "helpful": [0, 0], "unixReviewTime": 1395273600, "reviewText": "This is a little thinner and lighter than other cork boards I've had, meaning that it kind of lifts off the wall if just attached at the top.  You definitely want to mount it firmly.  Once it's mounted, it's a nice size and looks good - holds up things!", "overall": 4.0, "reviewTime": "03 20, 2014", "summary": "Thinner and lighter than I expected"}
,
{"reviewerID": "A1MBFUV5DZNEZQ", "asin": "B00FW6S1NA", "reviewerName": "R. M. Putnam \"Fantasy Writer\"", "helpful": [0, 0], "unixReviewTime": 1391644800, "reviewText": "These days my memory isn't what it use to be and so I have started writing notes to myself to stay on track. However, piles of notes don't get my interest and I still forget, appointments, grocery lists and other scheduled events. I wanted a bulletin board but at the store they are VERY expensive and either too big or too small. That said, I was happy to get the Quartet Cork Bulletin Board, just the perfect size for my kitchen, light weight, easy to hang and at a price I can afford. Now at first glance I can see all my appointments, events and grocery list. Yes, it is truly a life saver.", "overall": 5.0, "reviewTime": "02 6, 2014", "summary": "A life saver :)"}
,
{"reviewerID": "A1ZENB34HH2EIM", "asin": "B00FW6S1NA", "reviewerName": "SAlaska \"S\"", "helpful": [0, 0], "unixReviewTime": 1390953600, "reviewText": "Tacks and pushpins stay in.  The cork isn't sticky and weird.  The frame is simple and non-flashy which is quite suitable for an office basic like this one.Other reviewers already mentioned the tenacity of the self-stick hangers.  My board is stuck to my metal filing cabinet with magnets, so I haven't experienced any wrecked paint.  The board is light enough that the magnets hold it up just fine.I don't love it, but the board does what I need it to do at work.  That deserves 4 stars.  I don't need my bulletin board to be romantic or heavy-duty, so I'm happy with this one.", "overall": 4.0, "reviewTime": "01 29, 2014", "summary": "Very, very, very basic.  But I'm okay with that in a bulletin board."}
,
{"reviewerID": "A35VI0H5AFHOJ5", "asin": "B00FW6S1NA", "reviewerName": "Sharon Isch", "helpful": [0, 0], "unixReviewTime": 1390953600, "reviewText": "I've been wanting a bulletin board for the wall behind my home office desk chair for quite awhile.  The pictures in the room all have slender, vertical black metal frames so, when offered this vertical cork bulletin board with a black frame, I went for it.This frame is plastic and instead of meeting unobtrusively in the corners, the pieces meet about an inch away from the corners, with seams that are very noticeable; also, the vertical and horizontal pieces are of different widths. I could probably live with that. But a bulletin board that must be affixed to the wall with \"permanent self-stick pads\" that other reviewers here note would pull the paint off the wall along with it were I to move or remove it? That I won't do.I'm giving some thought to taking this to a framer who might be able to salvage the cork and put it in a slender black metal frame with a backing that won't pull the paint off the wall. If that works, and doesn't cost a whole lot,  I'll come back here and add a third star.", "overall": 2.0, "reviewTime": "01 29, 2014", "summary": "I guess you could call this an \"off the wall\" review"}
,
{"reviewerID": "AP42XSKSJMNYZ", "asin": "B00FW6S1NA", "reviewerName": "Sinfunni", "helpful": [0, 0], "unixReviewTime": 1393459200, "reviewText": "All cork boards aren&#8217;t created equal.  This one is definitely not a superior board; in fact, flimsy is the word that best describes it.  You can&#8217;t use it to hang jewelry on because the board can&#8217;t support the weight as the push pins are minimally supported by the thin cork. You can&#8217;t use it to secure multiple pages such as policies for the office. However, you could use it to secure single page memos and such.  The trick is to hang things that aren&#8217;t weighty.  My recommendation is to skip this one for one with better grade of cork and more substantial frame (this one is plastic). Yeah &#8220;you get what you pay for&#8221; but there should be more pride in the production of a product that carries your name. I say shame on the manufacturers of this product.", "overall": 1.0, "reviewTime": "02 27, 2014", "summary": "Put a cork in the production of this board"}
,
{"reviewerID": "AFYQ9V4XBVCJ1", "asin": "B00FW6S1NA", "reviewerName": "The Rothwells", "helpful": [0, 0], "unixReviewTime": 1391558400, "reviewText": "If you are looking for a cork board within the constraints of a very limited budget, this may be the product for you.  The &#34;frame&#34; is nothing but a plastic channel which is crudely adjoined at the corners.  The cork is quite thin, but will definitely hold a push pin [not included].  The entire board weighs next to nothing, which makes it simple to hang.  However, the fasteners included are PERMANENT double-edged tape.  For $14, and considering the BASIC quality of the materials used to manufacture this cork board, I honestly think Quartet could have afforded to provide a couple of 3M Command Strips.  I used a level to mark the wall where I wanted to hang the board.  I tried my very best to hang the board squarely on the line I had drawn, yet I was a little off and the board hangs slightly crooked.  TOO BAD.  There is NO WAY to adjust or remove the board now.  Actually, I am expecting that if I ever do want to remove the board, the wall paint is going to come along with it.  In this day and age, I think it is rather ridiculous that Quartet provided PERMANENT double-edged tape to mount this product.  I am now regretting using it.  I should have just purchased my own Command strips.  But, I was anxious to get the board hung, so I acted impulsively.  If you decide to order this product, I suggest you have Command strips on hand and completely discard the permanent tape included.  The board does the job.  It is just important to note that it is extremely basic.  It think it may be a good buy for the budget-conscious.", "overall": 3.0, "reviewTime": "02 5, 2014", "summary": "\"Cheap\" yet Functional. BASIC. BASIC. BASIC."}
,
{"reviewerID": "AOVTLYTHVDNUX", "asin": "B00FW6S1NA", "reviewerName": "Tradecraft \"Live by the Sword\"", "helpful": [0, 0], "unixReviewTime": 1393891200, "reviewText": "The Quartet Cork Bulletin Board, 17 x 23 Inches, Black Frame (MHOB1723-BK) is a nice cork board. It is important that you have it completely level before sticking to your wall. Also, be sure that wherever you hang it is where you want it to stay. Removing the board may take part of your wall depending on the surface that you stick it to. The good news is that it stays in place very well.", "overall": 4.0, "reviewTime": "03 4, 2014", "summary": "Works Well"}
,
{"reviewerID": "A2PD27UKAD3Q00", "asin": "B00FW6S1NA", "reviewerName": "Wilhelmina Zeitgeist \"coolartsybabe\"", "helpful": [0, 0], "unixReviewTime": 1392595200, "reviewText": "Quartet Cork Bulletin Board, 17 x 23 Inches, Black Frame, is a great light weight bulletin board. I love it. Well, except hanging it with double sided adhesive pads. I rigged some picture hanging hardware with a wire going from side to side so I could hang it where I want it now and easily move it if I'm rearranging things or moving. While the adhesive pads can be removed with some rubber cement thinner or lighter fluid, I don't want to do that.A basic, functional bulletin board that allows me to get stuff laying around on my drawerless desk off of it while keeping the stuff handy. It's a great place to put post-its, some photos to brighten your day, and all those urgent messages I keep &#34;forgetting&#34; to return.", "overall": 4.0, "reviewTime": "02 17, 2014", "summary": "Basic And Functional"}
,
{"reviewerID": "ARFCORBCTKX1J", "asin": "B00FW6S1NA", "reviewerName": "William Sommerwerck \"grizzled geezer\"", "helpful": [0, 1], "unixReviewTime": 1392336000, "reviewText": "I picked this for review because I needed a cork board. I had missed out on grocery discounts because the coupons expired. Now that they're tacked to this board, it's harder to miss them.Like other inexpensive Quartet products, the frame is plastic, not metal (\"silver frame\" notwithstanding). The manufacturer seems to think \"gray\" equates to silver. And for something mostly plastic, it strikes me as on the pricey side. (Quartet's oak-finish board is larger -- and costs less.)I have two gripes. One is that no pushpins are supplied. (I have some, but you'd think ACCO would include a dozen.) The other is that the only way to mount the board is with the supplied double-sided (and non-repositionable) adhesive pads. This is okay, only if you never move the board. I was hoping for rings, so the board could be hung with nails or (better) those 3M removable hooks.Not a bad product, but hardly one to get you jumping with excitement. It's serviceable.", "overall": 4.0, "reviewTime": "02 14, 2014", "summary": "plastic, not wood or metal"}
,
{"reviewerID": "A3MKON3VM0W1TH", "asin": "B00FW6S3P6", "reviewerName": "Alan Beggerow", "helpful": [0, 0], "unixReviewTime": 1395792000, "reviewText": "I've had a white board on the side of my refrigerator for years. Not the same one, as they do tend to fall apart after a time, and most of them have been just a little too large.This one is a nice size, big enough for multiple entries, small enough that it doesn't get in the way. It does appear to be quite well made, moreso than others I've had over the years.", "overall": 5.0, "reviewTime": "03 26, 2014", "summary": "Nice size"}
,
{"reviewerID": "A1UAZ6MNSZKB7G", "asin": "B00FW6S3P6", "reviewerName": "Amazon Customer", "helpful": [0, 0], "unixReviewTime": 1389139200, "reviewText": "Nice to have a color frame on a whiteboard! It's very cute, and just the right size (the same as regular letter size paper) for mounting on a fridge or a small wall space. It comes with magnetic strips you can attach to the whiteboard for mounting on a refrigerator. The board itself is magnetic, and a couple of magnets to hold paper memos or notes included, along with a dry-erase marker with a built-in eraser.The red color is a shade toward the burgundy side, just so you know.", "overall": 5.0, "reviewTime": "01 8, 2014", "summary": "Very cute!"}
,
{"reviewerID": "AD0WUBKBO21KK", "asin": "B00FW6S3P6", "reviewerName": "Amazon Customer", "helpful": [0, 0], "unixReviewTime": 1391126400, "reviewText": "This dry-erase board came with magnets, and I was going to use it on my fridge for a daily caper/chore chart.  However, using all the materials in the package, the magnets are not strong enough to stay on the fridge; the board keeps sliding down the side of the fridge.  I'm less than impressed as I don't have another good place to put it, and I'd have to install picture frame hardware to get it on the wall.  It does stay if the marker and clip and magnets are all off, but just barely.  So, this is okay if you have another place to put those items, like the top of the fridge, but it doesn't live up to all expectations.", "overall": 3.0, "reviewTime": "01 31, 2014", "summary": "Letter-sized memo board"}
,
{"reviewerID": "A2LHL3RYUYLCN8", "asin": "B00FW6S3P6", "reviewerName": "Amazon Customer \"Marty B\"", "helpful": [0, 0], "unixReviewTime": 1392249600, "reviewText": "White boards have become synonymous with thinking, planning, collecting thoughts for later organization. I have had a white board in every office I've occupied in the last 20 years because they help me visualize my projects, communicate to others and jot down random thoughts I need to remember.This Quartet board is the smallest I have ever worked with before and initially, I thought it would only be good for grocery lists. You know - you run out of peanut butter and napkins, so you write it down so you remember to get those things on your next grocery shopping trip. In &#34;portrait&#34; mode, this board is about right for two columns of about 10 items per column, so perfect for that kind of use.But I actually ended up using this petite board in my home office instead. It is too small to map out project plans, but perfect for- listing my &#34;Gotta Do Today&#34; projects- quickly recording &#34;Don't Forget You Promised&#34; items- moving around - from desk to planning table. I can use it to take quick notes while on a conference call, then carry it to another room to spread out my work papers and finish a project.I have used enough white boards to know that quality varies - some are so cheaply made that you can't cleanly erase text that has been left on the board too long. This one seems high quality - smooth surface and easy to clean. It comes with a small black dry erase pen and a clip that it slides into. It also comes with two magnets that I don't use - but you could hold a paper note to the board with the magnet if you roll that way. The plastic frame surrounding the board is an ugly avocado green that goes with... well, practically nothing, but it isn't distracting. The board quality is OK - the back of the board is cheap cardboard, so I don't know how long this will last. It doesn't come with any way to hang the board, but its small size means that you can put it just about anywhere - as long as it has a surface to stand on.Overall, this is a very handy size for my work and the quality of the writing surface is fine.", "overall": 4.0, "reviewTime": "02 13, 2014", "summary": "Size matters"}
,
{"reviewerID": "A3CIHP9FFPE9I3", "asin": "B00FW6S3P6", "reviewerName": "Amazon Customer \"Susan McIntyre\"", "helpful": [0, 0], "unixReviewTime": 1392768000, "reviewText": "I remember years ago when I wanted a write on magnetic board I had to search and finally paid a large amount at an office supply store for a very nice, heavy board.  I still have it and it is still in good shape.This small board is light weight and convenient to move around to where I need it.  It is white, comes with a clever pen that has an eraser on the end, and a couple of magnets.  It erases nicely and the magnets are sturdy firm.I have not tried to hang it on the wall, but the hanger doesn't appear to be very sturdy.  I have no idea how well made this is or how long it will last, but it is fine for now.", "overall": 4.0, "reviewTime": "02 19, 2014", "summary": "Nice"}
,
{"reviewerID": "A3EI4K5U61UZ7", "asin": "B00FW6S3P6", "reviewerName": "A Mother of 2 Kidlets", "helpful": [0, 0], "unixReviewTime": 1390780800, "reviewText": "I needed a smaller portable dry erase board for my math classes that I teach.  This is large enough for my small group to see, but not so big that isn't cumbersome to carry.  I ordered extra markers in difference colors.  The only reason I didn't give it 5 stars is that the trim has as unsightly seam that is destined to break apart like all of the other 11 x 14 boards I've had with this same design.", "overall": 4.0, "reviewTime": "01 27, 2014", "summary": "Love it"}
,
{"reviewerID": "A1T61QP7QHYBRQ", "asin": "B00FW6S3P6", "reviewerName": "an honest reviewer", "helpful": [0, 0], "unixReviewTime": 1395273600, "reviewText": "his is a good sized message board, not too large.The marker with the attached dry eraser is pretty nice. Handy.The clear magnets are great for attaching appointment cards or grocery lists, etc.I don't care for the provided means of securing it to a wall or refrigerator because for me it will not stick well enough.I'll get a mount at the hardware shop so I can fasten it to a wall with a better, firmer grip.", "overall": 4.0, "reviewTime": "03 20, 2014", "summary": "Handy Reminder"}
,
{"reviewerID": "A1HFT68GJ42LTM", "asin": "B00FW6S3P6", "reviewerName": "AverageGuyShopper", "helpful": [0, 0], "unixReviewTime": 1392768000, "reviewText": "It's pretty much one of those products that you expect to get what you pay for.  At this price point, &#60;$7, I don't think you can expect metal brackets, screws, and ledges.  It's not meant to be permanent, more convenient and disposable.  As such, it'd be perfect for college dorms and such.  It mounts with sticky tape and we use ours for grocery lists.  The 2 included magnets are handy too.", "overall": 4.0, "reviewTime": "02 19, 2014", "summary": "Is it cheap? Yes."}
,
{"reviewerID": "A2NML53YCHS80S", "asin": "B00FW6S3P6", "reviewerName": "Burgundy Damsel", "helpful": [0, 0], "unixReviewTime": 1391299200, "reviewText": "Big enough to allow for comfortable writing and full messages, but small enough to fit almost anywhere, this is an excellent size. The clip on top for the marker is a huge bonus, since I can never manage to keep them neatly on the trays that some other versions of whiteboards have. Came with two magnets, which seems appropriate for the size.Best part was the pre-cut magnets and sticky tape perfectly sized to fit the flat corner squares on the back - peel, stick, and mount in literally seconds. No fuss, no other supplies needed.", "overall": 5.0, "reviewTime": "02 2, 2014", "summary": "Highly Convenient"}
,
{"reviewerID": "ASFP250F22MDZ", "asin": "B00FW6S3P6", "reviewerName": "But I'm feeling much better now...", "helpful": [0, 0], "unixReviewTime": 1395100800, "reviewText": "I've been using this on my refrigerator using the magnets provided, although it can be attached to a wall using the included Scotch sticky pads.  It's nice to be able to remove it and carry it to my desk.  This is actually magnetic in two ways, the magnets can stick it to a steel surface, and the small buttons also included can also be used to attach papers to the board.What I can't quite put my finger on, and why I deducted one star, is it just looks cheap.  Could be a bit more sturdy without the obvious seams that hold it together showing.However, it is a nice product and I plan on using it daily to get a bit more organized.", "overall": 4.0, "reviewTime": "03 18, 2014", "summary": "Magnetic mounts are nice to take it down to write on."}
,
{"reviewerID": "A3CTI2ARGG2T7X", "asin": "B00FW6S3P6", "reviewerName": "B. Williams \"&#34;We must be the change we wi...", "helpful": [0, 0], "unixReviewTime": 1392854400, "reviewText": "My only qualm is that the magnets need  to be stronger,  As long as I have extra magnets on the refrigerator, it's fantastic! I leave notes there for things that need to be done. I also love the dry erase pen, which writes and erases!", "overall": 4.0, "reviewTime": "02 20, 2014", "summary": "Great for messages!"}
,
{"reviewerID": "ATJV9TWMRNF8K", "asin": "B00FW6S3P6", "reviewerName": "Cathe Fein Olson", "helpful": [0, 0], "unixReviewTime": 1391904000, "reviewText": "The board feels very cheap--cardboard back and plastic frame but the worst part is that it won't stay on the wall. We use the adhesive strips and it keeps falling off. Very, very unhappy with this product.", "overall": 1.0, "reviewTime": "02 9, 2014", "summary": "not happy with this"}
,
{"reviewerID": "A3CW8OUDH7M079", "asin": "B00FW6S3P6", "reviewerName": "C S Breedlove", "helpful": [0, 0], "unixReviewTime": 1391644800, "reviewText": "At our house, we have always had a white board attached to our fridge to jot down grocery lists as we use the product. Our last one bit the dust and we got this one.As a white board, it is fine.  The marker is easy to use and the surface is smooth.  The red color frame was cute and very bright.The frame itself is flimsy and it is already falling off.  The four magnets on the back that hold it to the fridge seem to be weak.  We put a magnet in each corner but as we write on the board, it slides off the fridge.  Really, really annoying.", "overall": 3.0, "reviewTime": "02 6, 2014", "summary": "Quartet Magnetic Dry-Erase Board"}
,
{"reviewerID": "A22DRQMROONYOK", "asin": "B00FW6S3P6", "reviewerName": "DDC", "helpful": [0, 0], "unixReviewTime": 1393113600, "reviewText": "This white board is only okay.  It comes with 2 magnets as well as the marker with eraser on top.  The plastic is really flimsy and when I took the magnets off the board for the first time they left a sticky residue behind.  I am only semi-happy with this board.", "overall": 3.0, "reviewTime": "02 23, 2014", "summary": "Ok, but not the best"}
,
{"reviewerID": "A1RFQVHBKVN4TA", "asin": "B00FW6S3P6", "reviewerName": "Debra Hamel", "helpful": [0, 0], "unixReviewTime": 1391040000, "reviewText": "This is a decent white board for the price. The frame is plastic, which betrays its cheapness, but it comes in attractive colors--mine is green--which is nice. The board comes with two magnets which can be used to affix items to the white board. Some of these Quartet magnets come with magnets that have a striped design. My board came with clear magnets, which are considerably less attractive than the striped magnets. Having this be a magnetic bulletin board is a nice touch, though I'm not sure yet if that will prove to be an important factor after continued use.The frame also comes with double sided tape and mounting magnets so that you can either affix the board to a wall or to a metal surface. To do the latter, you first position the tape on the back, then affix the magnets to the tape: the magnets themselves aren't sticky, in other words. I did not try hanging the board up on a wall, so I'm not sure whether that would hold well. But I did put the self-adhesive tape and magnets on the back and tried putting it up on my refrigerator. Unfortunately, the magnets weren't strong enough to hold the weight of the board, which slowly slid down the refrigerator door. It held a little more firmly--though not firmly enough--to the door of our dishwasher (the difference being, perhaps, that the refrigerator door is textured and the dishwasher door is smooth).So the two downsides of the board are the ugly magnets and the fact that the mounting magnets it comes with can't do the job of holding it up. The latter is the more important concern, but it's not a deal-breaker. In short, a good enough white board.", "overall": 4.0, "reviewTime": "01 30, 2014", "summary": "A decent white board"}
,
{"reviewerID": "A2ME89MSWVG9NF", "asin": "B00FW6S3P6", "reviewerName": "donny \"don130\"", "helpful": [0, 0], "unixReviewTime": 1390867200, "reviewText": "This board is great and the perfect size to fit on a fridge for shopping lists or notes. It is easy to put together and the magnets are a great addition for sticking paper notes to the board (especially if you don't have it on a magnetic fridge). The marker is easy to erase and writes cleanly.", "overall": 5.0, "reviewTime": "01 28, 2014", "summary": "Great fridge size"}
,
{"reviewerID": "A26DQMYF5E0GL6", "asin": "B00FW6S3P6", "reviewerName": "Don Walton Jr.", "helpful": [0, 0], "unixReviewTime": 1390262400, "reviewText": "I was looking for a new dry-erase board for the fridge, as our old one was dropped and cracked on the side.  I was thinking this would be perfect.There is some assembly required.  First double-sided tape, then the four magnets.  Alright, all put together, ready to hang...and it starts sliding down.  To be fair, I had the two included front magnets on the board, the marker attached by clip and A SINGLE 4x6&#34; PHOTO under one of the magnets.  I guess that extra gram made the difference, because it started sliding down immediately.Deal breaker.  Right there.  On top of that, 8 1/2&#34; x 11&#34; is a bit on the smaller side.  Our old board was maybe 11x14, but even that little extra room made a huge difference.I guess it would be ok for a dorm, or if you're old writing on it, and not using the included magnets to hold anything up...", "overall": 3.0, "reviewTime": "01 21, 2014", "summary": "Weak Magnets"}
,
{"reviewerID": "A2EDTVVR9IFNLW", "asin": "B00FW6S3P6", "reviewerName": "Doug Hibbard", "helpful": [0, 0], "unixReviewTime": 1389052800, "reviewText": "Let's take this in steps:1. Board Frame: it's red on the 11 inch sides, and gray on the 8 inch side, with that 1/2 inch being red. Look at the picture, that's how it looks. The frame clicks together, and then there are staples through the back into the actual board. It's sturdier than I expected, feels like it will work for write-on/wipe-off usage for classwork.How for classwork? If you take a dry-erase board like this, draw properly spaced lines with a ruler and a permanent marker, you have a great reusable practice tablet for learning letters. That's been great for kids, and great for learning foreign languages that use a different alphabet. (Or Aleph-bet, in my case.)Back to it:2. Magnets: there's two little disc-style magnets to hold stuff to the board. If you're using the board on a wall, they have plenty of sticky power for going through one layer of card stock, but they get iffy at 2 cards. If you're carrying the board around, I'd skip magneting anything to it--put them on the fridge, because they're good ones.3. Board surface (magnet): keep in mind, &#34;Magnetic Dry-erase Board&#34; means magnets stick to it, not that it is a magnet you can stick stuff to like paper clips. Not a big deal, but not perfectly clear in description.4. Board surface (Dry-erase): spotless white until somebody writes on it with a permanent marker (see above). It writes well, cleans well with simple wipe off. No complaints on it.5. Marker (included Black ReWritable): I want to like these, because I've got them in multiple colors, but I just don't. If you don't store it tip down, it dries and does not write well. The little eraser is less than effective. It's better than no marker, but it's not worth replacing it with one just like it.Overall, this is a great cubicle/desk message board or a fridge board. Obviously, if you're doing large-scale teaching, it's too small, but for tutoring in math or writing, it works pretty well.I'm satisfied with it, but there's nothing exceptional here to make it a 5-star board. It meets expectations well, and looks to be a good value for the budget.Just grab a better marker when the included one kicks the bucket.", "overall": 4.0, "reviewTime": "01 7, 2014", "summary": "Not bored with the board"}
,
{"reviewerID": "A1B4MIXYVIKMU2", "asin": "B00FW6S3P6", "reviewerName": "D. Truong \"-The Duke-\"", "helpful": [0, 0], "unixReviewTime": 1395273600, "reviewText": "This 8.5&#34; by 11&#34; dry erase board is basically a No-Frills magnetic dry erase board. I'm glad that they even make dry erase boards in this size because it's nice and portable. It's nice that it comes with 2 magnets and a dry erase marker included. As far as the build materials are concerned, I think they could've made it a little more resilient. The plus side is that it's very light since it's made from lightweight plastic and has a inner core of cardboard. Build materials aside, this dry erase board works well for what it is and is affordably price. I'd recommend it to anyone who needs a nice, usable, 'no frills' 8.5&#34; x 11&#34; dry erase board.", "overall": 4.0, "reviewTime": "03 20, 2014", "summary": "Nice No frills Dry-Erase board"}
,
{"reviewerID": "AJ8SVXL3SJN7T", "asin": "B00FW6S3P6", "reviewerName": "Grider \"Just Horses\"", "helpful": [0, 0], "unixReviewTime": 1392422400, "reviewText": "This dry wipe off board is for occassional use only.  You will also need to plan on purchasing your own dry erase marker, because the one that comes with it is already dried out.  Okay for light duty use.", "overall": 3.0, "reviewTime": "02 15, 2014", "summary": "Inexpensive and made that way"}
,
{"reviewerID": "A2AAHDM93LC9BI", "asin": "B00FW6S3P6", "reviewerName": "groomRN \"Erik\"", "helpful": [0, 0], "unixReviewTime": 1391644800, "reviewText": "This is an inexpensive board, so I wasn't expecting much in quality. But it turns out to be a very nice little board. Granted, it's plastic, but I wasn't expecting a fine wood frame! The magnets are nice, and very handy, and it came with a marker, too. I'm pleased with it for what I intend to use it for, which is at a wedding reception.", "overall": 5.0, "reviewTime": "02 6, 2014", "summary": "works fine"}
,
{"reviewerID": "A3M1PLEYNDEYO8", "asin": "B00FW6S3P6", "reviewerName": "G. Thomas \"Tom\"", "helpful": [0, 0], "unixReviewTime": 1390953600, "reviewText": "A nice simple white board.  The board comes with double sided adhesive strips.  We have it tacked right on the frig.  Great for notes and reminders.  The board comes with two little magnets that work well for tacking that shopping list.  We have magnetic clips that we use too.  Overall, a convenient size magnetic white board that is stylist and meets the need for reminders, notes....etc.", "overall": 5.0, "reviewTime": "01 29, 2014", "summary": "Great for messages"}
,
{"reviewerID": "A1E8XXAKINL0B1", "asin": "B00FW6S3P6", "reviewerName": "Heather LaRee", "helpful": [0, 0], "unixReviewTime": 1392940800, "reviewText": "This is a great dry erase board, especially for the fridge.  The build of the board itself and the frame are very sturdy.  It looks like it will withstand being moved from place to place for years to come.  Only comes with a black marker, which works for some.  We will certainly be buying more colors for this creative household.  The magnets adhere with 3M adhesive, so I have no worries about the board ever falling.  Very useful product in for making lists and reminders and love the red!!", "overall": 5.0, "reviewTime": "02 21, 2014", "summary": "Handy on the Fridge!"}
,
{"reviewerID": "ADJ0G262H54GP", "asin": "B00FW6S3P6", "reviewerName": "Hyde Park Doll", "helpful": [0, 0], "unixReviewTime": 1392940800, "reviewText": "The parents in my class what to know what happened each day and it is so much easier now that the class helps me list off all we did and I can put it out where the parents need to sign out their child. Now it didn't stick to our walls ever though it seemed very sticky. But that worked out for me since now the class helps me list what we did. I think it would stick to a flatter surface. I love the magnets that came with it. Very strong and will hold that note I needed to get to a parent.", "overall": 5.0, "reviewTime": "02 21, 2014", "summary": "just what I needed it"}
,
{"reviewerID": "A3F43PAJZLOE3I", "asin": "B00FW6S3P6", "reviewerName": "ice grizzly \"Grrrrrr\"", "helpful": [0, 0], "unixReviewTime": 1391731200, "reviewText": "Nothing special, but a very functional board. It does the job. Light weight, easy to hang on the wall with a few clips. Using a normal dry erase pen and wipe for daily use. Works well and cleans well. Lot of times even expensive boards dont wipe clean and leave a lot of streaks and dry up hard. This one is holing up so far after a month of use. Would buy again once it wears off", "overall": 5.0, "reviewTime": "02 7, 2014", "summary": "Good personal board"}
,
{"reviewerID": "A21QH2E3KFVMBM", "asin": "B00FW6S3P6", "reviewerName": "iheartjackbauer", "helpful": [0, 0], "unixReviewTime": 1396396800, "reviewText": "I was looking forward to having a small dry erase board hang on my office wall. The surface of this board worked fine. However, it didn't stick to the wall with the supplies provided.", "overall": 2.0, "reviewTime": "04 2, 2014", "summary": "Very unfortunate."}
,
{"reviewerID": "A1A027UELK4JZC", "asin": "B00FW6S3P6", "reviewerName": "Jami Garrison \"JamiRae\"", "helpful": [0, 0], "unixReviewTime": 1393977600, "reviewText": "I really like this dry-erase board.  It is the perfect size for just above my desk where I can write up my daily to-do list or reminders.  The one thing I had a problem with is that I wanted to mount it on my material-covered cubicle wall and be able to move it if needed.  The double-stick tape would have worked well enough, but velcro was the better choice.  So I got some sticky-backed velcro and stuck it to the back of the board then easily mounted it on the material-covered cubicle wall.  Now I can move the board if I need to simply by pulling it off and the velcro is still there so that the board can be mounted again elsewhere or back in the same spot.The color accent is also a nice touch and the little magnets are great for sticking a quick note to the board as well.", "overall": 4.0, "reviewTime": "03 5, 2014", "summary": "works great in the office"}
,
{"reviewerID": "A1T8J9GGK7WCFT", "asin": "B00FW6S3P6", "reviewerName": "J.D. \"LiteraryArky\"", "helpful": [1, 1], "unixReviewTime": 1393459200, "reviewText": "No surprises here.  This is a dry-erase board that I find to be the perfect size for the kitchen wall or refrigerator.  The pen works fine, and the attachments for wall mounting work well.  I was slightly disappointed in the quality of the frame.  It seemed a little crude.", "overall": 4.0, "reviewTime": "02 27, 2014", "summary": "A Good Size for the Kitchen"}
,
{"reviewerID": "A278LEQK1TEPVB", "asin": "B00FW6S3P6", "reviewerName": "Jen", "helpful": [0, 0], "unixReviewTime": 1390953600, "reviewText": "Since Amazon groups the reviews of the different sizes together, I will sum up the two that I received.I planned to replace the old dry-erase board on my refrigerator with the 8.5x11 one of these, but was extremely disappointed.  Four pieces of 3M adhesive are included along with four thin magnets -- you can use just the adhesive alone to hang the board, or you can attach the magnets and hang it using them.Unfortunately, the magnets are not strong enough to actually hold the board.  This reason I wanted this was, as I said, to replace the extremely worn dry-erase board on my refrigerator.  We've had other dry-erase boards on the fridge and never had this problem.On top of the magnetic problem, it feels cheap overall.  The marker is tiny, though at least it does have an eraser.  However, the first time I wrote something on the board it did not complete erase without scrubbing it with a tissue.  I think the spots where the marker remained were where the magnets were attached when packaged, so maybe in time that will go away (though it is seriously poor package planning).The only positive is it is more magnetic than other dry-erase boards I've had, but it is useless to me since I cannot hang it on my fridge and it is just absolute junk.  Bottom line is, find another dry-erase board -- this one isn't worth the money (not even the current $5.62 price).I also got the larger dry-erase board but did not attempt to use the magnets with that one.  However, it feels just as cheap as the smaller one.  I highly doubt the magnets included would hold that one either, but I attached it to a door so I was unable to test it.  So far the adhesive is holding it firmly in place.", "overall": 2.0, "reviewTime": "01 29, 2014", "summary": "Don't even bother"}
,
{"reviewerID": "A24N79JNVNFSBV", "asin": "B00FW6S3P6", "reviewerName": "jhcpa", "helpful": [0, 0], "unixReviewTime": 1394668800, "reviewText": "This board is the perfect size for my refrigerator. It shows the marker colors brightly, is easy to erase, and the markers write clearly on it. There are two little magnets that come with it, in case you feel the need to attach something to the board. They aren't terribly strong, but will be fine for the odd piece of paper you consider important enough to adorn your freezer door. I see no downsides to this product at all. The included marker is black and attaches to the top via a clip. I also have a set of dry-erase color markers that work very well with this board.  http://www.amazon.com/gp/product/B000E7D72C", "overall": 5.0, "reviewTime": "03 13, 2014", "summary": "Perfect For The Fridge"}
,
{"reviewerID": "AGFGY4EJ37VS2", "asin": "B00FW6S3P6", "reviewerName": "Joanne Harris \"Serendipity\"", "helpful": [0, 0], "unixReviewTime": 1390435200, "reviewText": "This board has a good size to it and looks great. It is magnetic like it indicates in the description and the dry erase quality works great. I loved that it came with a way to hang it magnetically, and so I hung it on my refrigerator. It is perfect there, except it does not have quite the magnetic strength on the hanger to stay put, so it falls easily. The only other issue is the border, which is green looks cheap and the seams that hols it together are not mesh with each other.", "overall": 4.0, "reviewTime": "01 23, 2014", "summary": "Pretty good,"}
,
{"reviewerID": "A3KZ7OH4VRL048", "asin": "B00FW6S3P6", "reviewerName": "Jonathan", "helpful": [1, 1], "unixReviewTime": 1393459200, "reviewText": "I've used Quartet boards before, and you can't beat them for the price. If you just need a small board for the occasional note, this will do wonders.The included magnets are a nice touch, and are stronger than I'm accustomed to coming from Quartet. On my older boards the included magnets could hold a single sheet of paper, but these managed four with no slippage.The marker, while an improvement, is still subpar. It writes better than previous versions, and the eraser is thicker as well. It still streaks while erasing every now and then, however, and the clip to hold it does so only loosely.I can't say this about this particular board given the length of time I've had it, but prior Quartet boards tend to get grungy after a while, with dry-erase marks becoming permanent rather quickly. So if you intend this board for heavy use, you might want to step up to the next price level.", "overall": 4.0, "reviewTime": "02 27, 2014", "summary": "Good for the price"}
,
{"reviewerID": "A31HO6KB5H5PL9", "asin": "B00FW6S3P6", "reviewerName": "JP Reader &amp;#34;Me&amp;#34; \"Me\"", "helpful": [0, 0], "unixReviewTime": 1390176000, "reviewText": "Very standard nothing fancy board to write notes.  It works well, but the magnets did not hold it well on our refrigerator, it would seem to be okay and then start to slide downward a couple of minutes later.  Wo we had to move it to the wall using the double backed tape.  I'm not sure if that was due to the magnets included or maybe the metal composition of the refrigerator???Regardless, handy little item to keep around any house, apartment or dorm room.", "overall": 4.0, "reviewTime": "01 20, 2014", "summary": "Works Well Enough"}
,
{"reviewerID": "A2XGFPVV6P815H", "asin": "B00FW6S3P6", "reviewerName": "J. Rubino", "helpful": [0, 0], "unixReviewTime": 1392163200, "reviewText": "I got this specifically for leaving messages and notes for the family. It is the perfect size for that.If you are thinking of putting it on a refrigerator as is the mounting magnets are likely not strong enough by themselvesto hold it on the fridge. With the super strong and small rare earth magnets I might have thought they would usethose instead. I put ours on a interior wooden door using double sided tape; with that application I have had no issuersand it works perfectly as a message and note board.", "overall": 4.0, "reviewTime": "02 12, 2014", "summary": "perfect size"}
,
{"reviewerID": "AGVDI7RLT24WJ", "asin": "B00FW6S3P6", "reviewerName": "J. Schwartz \"JMS\"", "helpful": [0, 0], "unixReviewTime": 1393632000, "reviewText": "I ended up using it as a magnetic bulletin board, but it is nice to have the option of using it as a dry erase board as well. It comes with some magnets and a marker. The marker includes and eraser. The marker does not write very well, but I had other dry erase markers available and they worked better, so it is not a problem with the board. With the better markers, it erased cleanly. The front magnets are reasonably strong. I mounted it with the double sided tape, which worked fine. I didn't try the magnetic mounting option. It is not a heavy duty product, but is a good value. I would rather have been sent the larger size to review. 8.5x11 is just too small.", "overall": 4.0, "reviewTime": "03 1, 2014", "summary": "Nice. The 8.5x11 size is too small. I recommend the larger size."}
,
{"reviewerID": "A2FVD05Z2FYW1P", "asin": "B00FW6S3P6", "reviewerName": "J. Silva", "helpful": [0, 0], "unixReviewTime": 1393200000, "reviewText": "This is a great little board to mount unobtrusively on the backsplash of a kitchen counter. Ours is mounted in such a way that it is right above the phone, and hides the phone's connector cords. Because it's magnetic, we can place shopping lists-in-progress on the board, and with the handy dry-erase pen, we can write simple messages that immediately catch the eye. We recently replaced our old fridge with a stainless model, which won't take magnets, so needed a small all-purpose board like this. It's perfect for our use!", "overall": 5.0, "reviewTime": "02 24, 2014", "summary": "Just the right size -- small but useful"}
,
{"reviewerID": "A2MCC0XFURU2K2", "asin": "B00FW6S3P6", "reviewerName": "Judah Levi", "helpful": [0, 0], "unixReviewTime": 1393718400, "reviewText": "My wife and I put this up right away in our pantry for keeping track of what is needed the next time we go to the grocery store.  I know, it is not electronic and cannot get you on the internet, but it works very well.There are several ways of hanging this board on the wall or you may use the magnets which are included.  It has a pen and eraser so you may begin using it immediately.  The size is about a sheet of paper 8 1/2 by 11 inches.  It is plastic, but should last for a very long time.Sometimes low tech is the way to go!", "overall": 5.0, "reviewTime": "03 2, 2014", "summary": "Wonderful Grocery List and Message Center"}
,
{"reviewerID": "A2BFC5WQGVP27G", "asin": "B00FW6S3P6", "reviewerName": "J. W. Kennedy \"in statu uiae et meriti\"", "helpful": [0, 0], "unixReviewTime": 1390953600, "reviewText": "8 1/2 x 11 is the size of a standard sheet of paper.  I know exactly how big that is; nevertheless I was still surprised when I got the item, by how small it is.  Not a whole lot of space for writing notes.  But on the plus side, it will fit just about anywhere, which is great if you don't have a lot of empty wall space for a larger board.It comes with two mounting options:  in a little baggie there are four squares of double-sided foam adhesive, and four squares of single-sided sticky magnets.  These fit on flat plastic panels in the corners on the back of the board.  You can only choose one method.  Once you've applied the mounts, they are pretty much on there permanently.  I went with the foam, and stuck it to a wall because most of my magnetic surfaces are already dry-erase-marker-friendly.Also included are two round magnets for sticking papers to the board, and a black marker with a felt eraser in the cap.  The clip that holds the marker can be positioned anywhere around the frame, and has a bit of sticky foam so you can secure it in place when you've decided where you want it.  I recommend doing this _before_ mounting the board on a wall; you can't do it afterward without a lot of difficulty and a butterknife.", "overall": 5.0, "reviewTime": "01 29, 2014", "summary": "Tiny whiteboard"}
,
{"reviewerID": "AA8F2HV4DPV2T", "asin": "B00FW6S3P6", "reviewerName": "kelpiegirl", "helpful": [0, 0], "unixReviewTime": 1395014400, "reviewText": "This board is used by my preschooler to practice drawing and handwriting.  It's easy to use, light weight, and big enough so he doesn't fill it up to quickly, get bored, and find something else to color on :-)  The quality is perfect for what I need it for.  It's nice for him that it's not boring silver or black like typically found in dry erase boards.", "overall": 5.0, "reviewTime": "03 17, 2014", "summary": "Great little board"}
,
{"reviewerID": "AZJFLPEG7D09G", "asin": "B00FW6S3P6", "reviewerName": "Lisa", "helpful": [0, 0], "unixReviewTime": 1406073600, "reviewText": "I'd rate it a 5 but the picture seems to give a more vibrant green than it really is. I'd say in this it sort of looks lime but in reality it is more of a dull-ish avocado color. This may not matter to some (most?) people but I personally was hoping it was more vibrant/lime like the picture. Other than the color it's a great board.", "overall": 4.0, "reviewTime": "07 23, 2014", "summary": "Dull Avocado Green vs Vibrant Lime Green"}
,
{"reviewerID": "AY1I85LLDMETC", "asin": "B00FW6S3P6", "reviewerName": "L. Jacobs \"The Rescue You Program\"", "helpful": [0, 0], "unixReviewTime": 1395878400, "reviewText": "My family loves this board for the refrigerator. It comes with four sturdy magnets to adhere to the back of the board, and it holds up well. The pen is long-lasting and clear, and I love the eraser tip on the cap. The magnets that it comes with are super-strong. It's durable and high-qaulity - excellent product.", "overall": 5.0, "reviewTime": "03 27, 2014", "summary": "Great board"}
,
{"reviewerID": "A1FJFLAAQD5WH2", "asin": "B00FW6S3P6", "reviewerName": "Lori Caswell \"dollycas\"", "helpful": [1, 1], "unixReviewTime": 1391126400, "reviewText": "I love these boards. I hang them everywhere. This one is on my refrigerator. I was disappointed a bit in the color. It is more of a dull green than the bright green shown. The writing surface also moves around quite a bit in the frame and the magnets were tightly glued to the surface and were hard to remove. It also left behind a very sticky residue that does not wash off with soap and water. Goo Gone was used and now that area is not as shiny as the rest. Also the marker was completely dried out.", "overall": 2.0, "reviewTime": "01 31, 2014", "summary": "Love this type of board but this one has some flaws."}
,
{"reviewerID": "A3KZEGBTPH6MMF", "asin": "B00FW6S3P6", "reviewerName": "Lucy Cat \"Mandy\"", "helpful": [0, 0], "unixReviewTime": 1389744000, "reviewText": "This is a nice high quality dry erase board with a writing surface the same size as a standard US sheet of paper (8.5 x 11).  The surface is magnetic and includes two small round magnets as well as additional magnets for mounting the board on a refrigerator.  A nice fine point dry erase marker is included and 3M (Command Center) hanging tabs for mounting the board on a standard wall.The board erases cleanly and writes very smooth.  It's the perfect size for a dorm room, kitchen, office or just to jot down notes or messages and carry around the house with you.Exactly what I needed! Highly recommended!", "overall": 5.0, "reviewTime": "01 15, 2014", "summary": "Perfect small dry-erase with all hanging tools included"}
,
{"reviewerID": "A1PPPCF42TMACV", "asin": "B00FW6S3P6", "reviewerName": "Mace Thomas", "helpful": [0, 0], "unixReviewTime": 1395878400, "reviewText": "What can you say about a white board?  The size of it seems to be perfectly suited to mounting on a fridge and it comes with a single black marker.  It is mounted on the top of the board and comes with a small eraser too. The board contains a couple of magnetic surfaces that are slightly recessed from the frame, so the magnets do not have a full grip of the mounting surface, but still work well.  No issues = 5 stars.", "overall": 5.0, "reviewTime": "03 27, 2014", "summary": "White dry erase"}
,
{"reviewerID": "A9NXTC0HTPSDO", "asin": "B00FW6S3P6", "reviewerName": "Maggie", "helpful": [0, 0], "unixReviewTime": 1392854400, "reviewText": "This is a typical whit board.  It does what it is supposed to do.  The included magnets are helpful.  I wish it at least came with an eraser and solution.  Even if it was just a small amount of cleaning solution, it would make it more valuable to purchase.", "overall": 3.0, "reviewTime": "02 20, 2014", "summary": "What is there to say?"}
,
{"reviewerID": "A2VJJ2POCLMED7", "asin": "B00FW6S3P6", "reviewerName": "Marshall W. Carter \"Ornery Gamer, Fiend Club ...", "helpful": [0, 0], "unixReviewTime": 1391212800, "reviewText": "This isn't our first Quartet Magnetic Dry Erase board. We used to have one on the fridge when our twins were born to keep track of feedings as well as to keep a running list of needs. It had a few issues, the biggest one being that the included magnets just simply weren't strong enough to keep it up. We used other magnets to &#34;prop&#34; it in position, but after a few slides and falls, we ended up having to get rid of it.This new Quartet Magnetic Dry erase board has all of the same issues. The build quality isn't great (plastic frame on a cardboard backing), the included marker is basically throwaway quality and the magnets still don't have the strength to keep it in position. In fact, we're using the included circle/posting magnets underneath the board in an attempt to again keep it &#34;propped&#34; into position.The board itself is fine, and the frame isn't unsightly, but I'm afraid that after a few more slides and falls, it too will be destined for the trashcan.", "overall": 2.0, "reviewTime": "02 1, 2014", "summary": "Not terrible for the price, but a few things make it hard to recommend."}
,
{"reviewerID": "A2BWZGD7S0JZQJ", "asin": "B00FW6S3P6", "reviewerName": "Martin P. McCarthy", "helpful": [0, 0], "unixReviewTime": 1390867200, "reviewText": "The Quartet Magnetic Dry-Erase Board is advertised as being capable of being used out of the box and that claim is correct. Included with the product are self-sticking adhesive pads and dry-erase marker. Because I saw no utility of using the magnets affixed to the board (see picture), I removed them. Removing the magnets does no damage to the dry-erase board, affixed the adhesive pads, stuck it on my door and proceeded to write on it in about 15 minutes.One handy feature that is not listed is that on the tip of the dry-erase marker provided with the product is a handy eraser, which obviates the need of using a paper towel (though that will certainly work too).All in all, a great product for the cost.", "overall": 5.0, "reviewTime": "01 28, 2014", "summary": "Easy to use"}
,
{"reviewerID": "A250GXRD2BGQV2", "asin": "B00FW6S3P6", "reviewerName": "NatureLover", "helpful": [0, 0], "unixReviewTime": 1392854400, "reviewText": "This board is a nice size for jotting down quick notes; the magnets are useful too.It's a little cheap-looking, with the green plastic border.The magnet that's on the end of the included marker really isn't strong enough to hold the marker in place, so I just added my own pieces of Velcro to the cap & board to hold it more tightly.  But, the marker writes clearly & erases cleanly.", "overall": 4.0, "reviewTime": "02 20, 2014", "summary": "Handy size & useful"}
,
{"reviewerID": "A1FYYHVUDAYU53", "asin": "B00FW6S3P6", "reviewerName": "Orianna", "helpful": [0, 0], "unixReviewTime": 1390953600, "reviewText": "The price is cheap and so is this product. It's a small whiteboard in a plastic frame. The description said it's a calender board with a grid printed on it, so you can fill in each day of the month---however this is not the case. It's a plain whiteboard, nothing fancy.Pros:* It comes in a variety of colors. I chose green to coordinate with my sewing room and the color was exactly like I expected.* It's a magnetic whiteboard, so you can attach photos, sketches, or even business cards, and then make notes beside them.* It comes with a small dry-erase marker, so you can use the board immediately, without making an additional purchase of markers.* It comes with two large, round, clear plastic magnets, so you don't have to buy separate magnets to use the magnetic feature.Cons:* It's pretty small. Check the measurements and be sure the size is what you want, so you aren't disappointed.* The plastic frame is very cheap. There's actually a gap between the frame and the board, which increases when you apply pressure to the board---like when writing on it. I worry that the frame will eventually come loose.* The magnets it comes with are stuck to the board with a blob of sticky goo, which refused to wipe off once I removed the magnets. I had to pull out the Goo-Gone in order to clean the sticky spot off the board. (It worked nicely, but I shouldn't have to use a cleaning product to make my purchase usable.)* It doesn't have a hanger on the back, so you can't just hang it on your wall. It comes with both adhesive pads and magnets, so you can either stick it on your refrigerator (or a metal door, etc.), or you can use the adhesive squares to stick it to your wall. I don't care for either idea, personally. There is no metal surface to attach it to in my sewing room, and besides, several reviewers have stated that the magnets aren't strong enough to anchor the whiteboard in place, so it slides down. As for the adhesive squares, I'm guessing that if you use them, you can't easily move the board, and if you tried, I'm sure the adhesive would ruin the paint on the wall. This may not be the case, but I'm loathe to try it, just in case I'm right.In conclusion, this is a classic example of getting what you pay for. If you want a small, cheap whiteboard, this will serve you well. Personally, I would save my money and buy something a little higher in quality. I'll give it three stars and hesitantly recommend it, with the above-mentioned caveats.", "overall": 3.0, "reviewTime": "01 29, 2014", "summary": "You Get What You Pay For"}
,
{"reviewerID": "A2DBEQX2Y5WDT", "asin": "B00FW6S3P6", "reviewerName": "Patti Ives", "helpful": [0, 0], "unixReviewTime": 1391817600, "reviewText": "What can you say about a dry erase board? It is small, which is just what I was looking for. I can't speak to how well the mounting system works because I just use it on a table next to me. I am learning machine quilting and I use this little board to practice drawing the patterns before I go to the sewing machine. The magnets work about as good as most of the other boards in this price range. The only problem I noticed was that after erasing there was a ghost image left on the board that just did not go away. No biggie as I just draw over it.", "overall": 3.0, "reviewTime": "02 8, 2014", "summary": "It is adequate"}
,
{"reviewerID": "A1VTBADV3JS1EC", "asin": "B00FW6S3P6", "reviewerName": "Randi Morse", "helpful": [0, 0], "unixReviewTime": 1392595200, "reviewText": "I'm a fan of dry erase boards and we've recently decided to use them more to help us organize ourselves. It was obvious that this board is a fairly cheap one right out of the package, and I do not recommend using the little eraser that comes on the dry erase marker as it does not work well.If dinged even a bit, this board shows the ding very easily, but the magnetic pieces work beautifully and it's stayed on the refrigerator perfectly, helping us to remember what groceries we need.", "overall": 3.0, "reviewTime": "02 17, 2014", "summary": "Pretty cheap but usefeul"}
,
{"reviewerID": "A8WAYVOKYBLO6", "asin": "B00FW6S3P6", "reviewerName": "Rane E Stark", "helpful": [0, 0], "unixReviewTime": 1389916800, "reviewText": "The white board surface is good quality. It wipes clean, without any shadowing or staining. The included marker is the perfect size for writing quick notes and has an attached eraser.Overall, I like this a lot and it is a great addition to the kitchen, but I do have two complaints: the mounting magnets are too weak, it doesn't want to stay on the fridge, it sort of slowly slides down the face of it; and, the magnets for holding notes and things are glued to the board and it is almost impossible to get all of the glue off. The residue from the glue that holds the magnets makes the surface difficult to use in that area.I only took one star off for the issues I mentioned above, because the product is otherwise perfect.", "overall": 4.0, "reviewTime": "01 17, 2014", "summary": "Works well"}
,
{"reviewerID": "AFJFXN42RZ3G2", "asin": "B00FW6S3P6", "reviewerName": "R. DelParto \"Rose2\"", "helpful": [0, 0], "unixReviewTime": 1391040000, "reviewText": "The Quartet dry-erase white board provides the practical way to make necessary notes and reminders.  With its simple green trim and size 11x 14, enough information can be written on the board with the black marker that comes with a small eraser at the tip of its cover.  But in addition to the board's basic features, it also contains adhesive stickers to hang the board on the wall and two magnets that can also be hung on a fridge or any flat surface and two separate gray-colored magnets to post papers and coupons on the front of the board.As a result of the convenient size and basic features, the white board is a helpful item to stay organized when it comes to keeping track of the daily and weekly tasks that can easily be written down and simply erased with little fuss.", "overall": 4.0, "reviewTime": "01 30, 2014", "summary": "Write it down"}
,
{"reviewerID": "AIXDV2Z2NEYP6", "asin": "B00FW6S3P6", "reviewerName": "Renee O Pruitt", "helpful": [0, 0], "unixReviewTime": 1393459200, "reviewText": "I needed these for classroom math games. (Groups take turns solving the problem and hold up the board when the group is done. The first one with a right answer gets a point. Paper was making a mess like this, so I'm glad to have the little boards.)Great price too! I did not use the magnets or the stickies. I am thinking about getting one for little reminders by the door.  The magnets seem pretty strong, so I could put little notes up too. Love it!", "overall": 5.0, "reviewTime": "02 27, 2014", "summary": "Perfect for what I needed"}
,
{"reviewerID": "AQFORCKKB6F8I", "asin": "B00FW6S3P6", "reviewerName": "Rough Customer", "helpful": [0, 0], "unixReviewTime": 1390694400, "reviewText": "I applied the four magnets to the double side foam spacers (which have tape on one side to secure to back of dry erase board) and put one magnet on each of the four sides of the board.  I thought this would be a great thing to put on the top freezer door or side of the refrig for a shopping list or notes.  To my great surprise the weight of the dry erase board, was enough to make it slide down the face of the refrigerator door or side.  The only way I have found to stop this is to put the top magnets at the very top of the door, and put another magnet below the dry erase board to keep it from sliding down the door.  The four magnets supplied, are not strong enough to secure the board to the refrigerator.  The refrigerator is about 4 years old, and is full size Whirlpool with a black textured finish.  Perhaps it might not slide down if the finish was completely smooth?  Most refrigerators today are made with a textured finish.  Not recommended for use on refrigerator.  Sure it would work okay if secured in another way to a wall or cabin door etc.  The plastic frame around the dry erase board looks cheap.  Made in China.", "overall": 2.0, "reviewTime": "01 26, 2014", "summary": "Slides down Refrigerator side/door...not magnetic enough"}
,
{"reviewerID": "A3VS2RYRGDW4HS", "asin": "B00FW6S3P6", "reviewerName": "Shannan", "helpful": [0, 0], "unixReviewTime": 1395273600, "reviewText": "The Quartet Dry-Erase board is very handy for writing quick notes, shopping lists, or for your grandchild to draw to their heart's content.  It comes with 2 magnets (other magnets also work).  It also comes with 3M double sided sticky squares for mounting the board to a surface, as well as a magnetic strip that can be stuck to the back side of the board, and the board can then be stuck to a metal surface, such as a filing cabinet or refrigerator.  The sticky square method is semi-permanent, meaning you can't take it on and off, but the magnetic method allows for easy removal and replacement of the board.  The magnetic strip is strong enough to hold the board in place, but it would slip down when I tried to write on it while adhered to the refrigerator.  It is simple, though, to remove the board from the fridge, write on it, then put the board back.It also comes with a small, black dry erase marker that can be snapped into a holder at the top of the board.  This is very handy and means you won't be searching for the marker.The entire board is the size of an 8.5 x 11 piece of paper, with the writing surface about 1/2&#34; smaller on the sides and 3/4&#34; smaller on the top and bottom.", "overall": 4.0, "reviewTime": "03 20, 2014", "summary": "An attrative little whiteboard"}
,
{"reviewerID": "APDPA11IZPYLN", "asin": "B00FW6S3P6", "reviewerName": "Sheila Chilcote-Collins \"Sheila Renee Chilcot...", "helpful": [0, 0], "unixReviewTime": 1395273600, "reviewText": "This dry erase board at just under $7.00 is an awesome steal.  I got the green (a little disappointed in the color, as I thought it would be a bright spring green but it is definitely an avocado green).  The board comes with a medium, black dry erase marker with an eraser on the end, two magnets and four each of 3-M brand permanent self stick mounting pads and self stick magnets with instructions for mounting.A great little dry erase board at an even greater price!", "overall": 4.0, "reviewTime": "03 20, 2014", "summary": "Great Dry Erase Board At An Even Greater Price!"}
,
{"reviewerID": "A2L9OPJAAEK08Q", "asin": "B00FW6S3P6", "reviewerName": "spin_nin", "helpful": [0, 0], "unixReviewTime": 1393027200, "reviewText": "But it works great.We've been using this steadily since it arrived, and it's hard to imagine how we got along without it before.The included marker with eraser works really well.I'm not exactly sure what the purpose of the two magnets is, but the board itself and the marker and the eraser attached to the marker make it easy to leave notes, make lists, etc.The only drawback to this product is the PERMANENT mounting adhesive included with it. I may want to move it or take it to my next apartment and the included mounting system doesn't make that easy.", "overall": 4.0, "reviewTime": "02 22, 2014", "summary": "It's a little small"}
,
{"reviewerID": "A1MRRMHGV3PN5W", "asin": "B00FW6S3P6", "reviewerName": "Stacie L. Helsing \"stacielc\"", "helpful": [0, 0], "unixReviewTime": 1393545600, "reviewText": "I really wanted to like this Dry Erase Board but so many things were wrong with it that I couldn't.  First, I tried sticking it to my wall next to the front door with the double sided tape so that my husband, kids and I could leave messages for eachother.  It fell off the wall repeatedly.  So, I decided to use the magnets to hold it to my metal door.  It slid down the door.  Tried it on the fridge, and it slid there too.  Once I got it to finally stay where I wanted it, using a special double sided tape my husband brought from work, the marker started falling off.  Lastly, the marker started drying out within a week of using it and yes, we did put the cap on it every time so we had to buy a set of markers and leave them in a cup next to the board.  The only thing that worked well with the whole thing was that the board erased easily.", "overall": 2.0, "reviewTime": "02 28, 2014", "summary": "One step above awful"}
,
{"reviewerID": "A8QYRG7TW491B", "asin": "B00FW6S3P6", "reviewerName": "Thee~Classy~Gal", "helpful": [0, 0], "unixReviewTime": 1391299200, "reviewText": "I rated Quartet Magnetic Dry-erase board 4 stars because it is a nice product. This is lightweight, magnetic, and comes in a pleasant green color that can easily be portable or placed on a wall. For now, I will not put the sticky attachments on the back because I like to take this with me and use it teaching small kids.I didn't give it 5 stars because it is not doublesided, it would be better to include another lined dry erase board on the back side.", "overall": 4.0, "reviewTime": "02 2, 2014", "summary": "i Like it"}
,
{"reviewerID": "AL6CEWLV2JB90", "asin": "B00FW6S3P6", "reviewerName": "The Writing Chef \"Dan\"", "helpful": [0, 0], "unixReviewTime": 1390694400, "reviewText": "We have several white boards in our office, and they are quite useful. I was looking forward to taking this one home and using in my home office. Well, I did, and it's pretty good. They used a rather cheap green plastic around the edges (our others are metal) and it's a bit smaller than I'm used to, but it's good for making simple notes. All in all, if you need an inexpensive white board, this is fine.", "overall": 4.0, "reviewTime": "01 26, 2014", "summary": "Very nice"}
,
{"reviewerID": "A156P4FPL8OGXB", "asin": "B00FW6S3P6", "reviewerName": "Tim Drake \"Author and Journalist\"", "helpful": [0, 0], "unixReviewTime": 1389312000, "reviewText": "We obtained the Quartet Magnetic Dry-Erase Board for our son's dorm room. It's a great, light-weight product with a stylish look. The red border gives it a look that's set apart from the ordinary. The board (sized 8.5X11) operates as both a dry erase writing board AND a magnetic bulletin board. It can be hung either horizontally or vertically with the enclosed self-stick pads. The board also includes a dry-erase marker and two magnets allowing you to start using it immediately.I will also say that the product is pretty sturdy. It withstood the wrath of our dog, who discovered the package and tore the outer cardboard box apart. The board made it through this ordeal with only a slight tear on the backside.", "overall": 5.0, "reviewTime": "01 10, 2014", "summary": "Great for the Board Room, Kitchen or Dorm Room"}
,
{"reviewerID": "A3VZH0PWLQ9BB1", "asin": "B00FW6S3P6", "reviewerName": "Tom B.", "helpful": [0, 0], "unixReviewTime": 1390521600, "reviewText": "This is a nice dry erase board. It is perfect for family communication for for a dorm or office door. It can adhere to most any surface with the included adhesive magnets or adhesive glue strips. They stick very well to not only the board to most anything you'd care to stick it to.the surface is magnetic, and includes 2 magnets and a magnetic pen with eraser. It writes smoothly and erases clean.", "overall": 5.0, "reviewTime": "01 24, 2014", "summary": "Nice dry erase board. Magnetic, and adheres to wall"}
,
{"reviewerID": "A3IMK08UX0I46A", "asin": "B00FW6S3P6", "reviewerName": "TOPJOB7 \"topjob7\"", "helpful": [0, 0], "unixReviewTime": 1394064000, "reviewText": "I got this to put on my fridge for writing my grocery list on because it said 'magnetic' and I have more fridge space than wall space in my kitchen. I thought it would be a magnetic sheet with a pretty green border that would stick to my fridge. Instead it is a metal white board with a thick cardboard backing inside a plastic frame. The green is kind of a pale olive color - nice.  It also includes two round magnets in plastic to hold things onto the board and a dry-erase pen that can write on the surface.  There is a small magnet on the pen so it can stick to the board when the cheap plastic clip on top of the board breaks.In the package, the magnets are stuck to the board with sticky stuff - to get it off, I just rubbed it around with my finger until it rolled up into a sticky ball that came right off with no residue.The board comes with foam double-sided sticky pads which you must stick on the back. Then you have a choice to either stick those pads to a surface, or to stick the provided magnets on the sticky pads. I stuck the magnets on the sticky pads. Which means I had magnets on foam coming out from the back of the framed whiteboard. Rather bulky and protruding, which I don't care for.And as it happens, the magnets are not strong enough, so when I put it on my fridge it slides down, down, down until something decides to catch it, namely the controls for the ice maker. OK, I guess that works... until someone comes along and bumps it because it is sticking out!In the end, I remounted it on the back side of my pantry door - not exactly where I wanted it, but I can still jot down reminders and it isn't as likely to catch on someone's clothes.PROS:Surface is both dry-erase writable and magnets stick to itSticky foam has a strong holdCONS:Mounting magnets too weak to stick to fridgeProtrudes from whatever surface it is mounted on", "overall": 3.0, "reviewTime": "03 6, 2014", "summary": "Protrudes, magnets too weak to stick to fridge."}
,
{"reviewerID": "A2DXXJR0N8BXOK", "asin": "B00FW6S3P6", "reviewerName": "Whidbey Mary", "helpful": [0, 0], "unixReviewTime": 1393459200, "reviewText": "Comes with harware to hang it.  I can magnetically hang sketches, patterns, and instructions for ongoing projects yet use as a white board for notes and deadlines.  Versatile and just the right size.", "overall": 4.0, "reviewTime": "02 27, 2014", "summary": "Great for keeping track of projects"}
]
